[Killed] BlockStatement
entities/character/domain/IllnessService.ts:44:21
 	public applyStatusDecorators(
 		baseStats: ICharacterStats,
 		activeEffects: readonly CharacterStatusEffectRecord[],
-	): ICharacterStats {
-		let decoratedStats = baseStats;
-
-		for (const effect of activeEffects) {
-			switch (effect.type) {
-				case "eter_fever":
-					decoratedStats = new EterFeverDecorator(decoratedStats);
-					break;
-				case "wound_infection":
-					decoratedStats = new WoundInfectionDecorator(decoratedStats);
-					break;
-				case "viper_poison":
-					decoratedStats = new ViperPoisonDecorator(decoratedStats);
-					break;
-				default:
-					// Efeito desconhecido ou não-decorável ignorado silenciosamente
-					break;
-			}
-		}
-
-		return decoratedStats;
-	}
+	): ICharacterStats {}
 
 	/**
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:47:39
 	): ICharacterStats {
 		let decoratedStats = baseStats;
 
-		for (const effect of activeEffects) {
-			switch (effect.type) {
-				case "eter_fever":
-					decoratedStats = new EterFeverDecorator(decoratedStats);
-					break;
-				case "wound_infection":
-					decoratedStats = new WoundInfectionDecorator(decoratedStats);
-					break;
-				case "viper_poison":
-					decoratedStats = new ViperPoisonDecorator(decoratedStats);
-					break;
-				default:
-					// Efeito desconhecido ou não-decorável ignorado silenciosamente
-					break;
-			}
-		}
+		for (const effect of activeEffects) {}
 
 		return decoratedStats;
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 3 to be +0 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:49:5
 
 		for (const effect of activeEffects) {
 			switch (effect.type) {
-				case "eter_fever":
-					decoratedStats = new EterFeverDecorator(decoratedStats);
-					break;
+				case "eter_fever":
 				case "wound_infection":
 					decoratedStats = new WoundInfectionDecorator(decoratedStats);
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 2 to be 1 // Object.is equality

[Killed] StringLiteral
entities/character/domain/IllnessService.ts:49:10
 
 		for (const effect of activeEffects) {
 			switch (effect.type) {
-				case "eter_fever":
+				case "":
 					decoratedStats = new EterFeverDecorator(decoratedStats);
 					break;
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 2 to be 1 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:52:5
 				case "eter_fever":
 					decoratedStats = new EterFeverDecorator(decoratedStats);
 					break;
-				case "wound_infection":
-					decoratedStats = new WoundInfectionDecorator(decoratedStats);
-					break;
+				case "wound_infection":
 				case "viper_poison":
 					decoratedStats = new ViperPoisonDecorator(decoratedStats);
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:55:5
 				case "wound_infection":
 					decoratedStats = new WoundInfectionDecorator(decoratedStats);
 					break;
-				case "viper_poison":
-					decoratedStats = new ViperPoisonDecorator(decoratedStats);
-					break;
+				case "viper_poison":
 				default:
 					// Efeito desconhecido ou não-decorável ignorado silenciosamente
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 2 to be +0 // Object.is equality

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:58:5
 				case "viper_poison":
 					decoratedStats = new ViperPoisonDecorator(decoratedStats);
 					break;
-				default:
-					// Efeito desconhecido ou não-decorável ignorado silenciosamente
-					break;
+				default:
 			}
 		}

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:78:32
 		// Validar se o personagem já está sofrendo desse efeito para evitar duplicidade
 		const existingResult =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!existingResult.success) {
-			return fail({
-				code: "FETCH_STATUS_EFFECTS_FAILED",
-				message:
-					"Não foi possível verificar os efeitos de status do personagem.",
-			});
-		}
+		if (!existingResult.success) {}
 
 		const alreadyInfected = existingResult.data.some(
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao infectar personagem se a busca pelos efeitos de status no repositório falhar
statusReason: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:78:7
 		// Validar se o personagem já está sofrendo desse efeito para evitar duplicidade
 		const existingResult =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!existingResult.success) {
+		if (true) {
 			return fail({
 				code: "FETCH_STATUS_EFFECTS_FAILED",
killedBy: SurvivalService deve usar DiceService e IllnessService padrões se não forem fornecidos
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
entities/character/domain/IllnessService.ts:80:11
 			await this.repository.findStatusEffectsByCharacterId(characterId);
 		if (!existingResult.success) {
 			return fail({
-				code: "FETCH_STATUS_EFFECTS_FAILED",
+				code: "",
 				message:
 					"Não foi possível verificar os efeitos de status do personagem.",
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao infectar personagem se a busca pelos efeitos de status no repositório falhar
statusReason: expected '' to be 'FETCH_STATUS_EFFECTS_FAILED' // Object.is equality

[Killed] MethodExpression
entities/character/domain/IllnessService.ts:86:27
 			});
 		}
 
-		const alreadyInfected = existingResult.data.some(
-			(e) => e.type === diseaseType,
-		);
+		const alreadyInfected = existingResult.data.every(e => e.type === diseaseType);
 		if (alreadyInfected) {
 			return fail({
killedBy: SurvivalService deve usar DiceService e IllnessService padrões se não forem fornecidos
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:87:11
 		}
 
 		const alreadyInfected = existingResult.data.some(
-			(e) => e.type === diseaseType,
+			(e) => false,
 		);
 		if (alreadyInfected) {
killedBy: IllnessService - Integração e Testes de Patologias deve rejeitar duplicidade de infecção do mesmo tipo no mesmo personagem
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:87:11
 		}
 
 		const alreadyInfected = existingResult.data.some(
-			(e) => e.type === diseaseType,
+			(e) => e.type !== diseaseType,
 		);
 		if (alreadyInfected) {
killedBy: IllnessService - Integração e Testes de Patologias deve rejeitar duplicidade de infecção do mesmo tipo no mesmo personagem
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:89:24
 		const alreadyInfected = existingResult.data.some(
 			(e) => e.type === diseaseType,
 		);
-		if (alreadyInfected) {
-			return fail({
-				code: "ALREADY_INFECTED",
-				message: `O personagem já está sob o efeito de ${diseaseType}.`,
-			});
-		}
+		if (alreadyInfected) {}
 
 		const timestamp = this.clock.now();
killedBy: IllnessService - Integração e Testes de Patologias deve rejeitar duplicidade de infecção do mesmo tipo no mesmo personagem
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:89:7
 		const alreadyInfected = existingResult.data.some(
 			(e) => e.type === diseaseType,
 		);
-		if (alreadyInfected) {
+		if (true) {
 			return fail({
 				code: "ALREADY_INFECTED",
killedBy: IllnessService - Integração e Testes de Patologias deve infectar um personagem com sucesso persistindo na tabela SQLite de status effects
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/IllnessService.ts:90:16
 			(e) => e.type === diseaseType,
 		);
 		if (alreadyInfected) {
-			return fail({
-				code: "ALREADY_INFECTED",
-				message: `O personagem já está sob o efeito de ${diseaseType}.`,
-			});
+			return fail({});
 		}
 
killedBy: IllnessService - Integração e Testes de Patologias deve rejeitar duplicidade de infecção do mesmo tipo no mesmo personagem
statusReason: expected undefined to be 'ALREADY_INFECTED' // Object.is equality

[Killed] StringLiteral
entities/character/domain/IllnessService.ts:91:11
 		);
 		if (alreadyInfected) {
 			return fail({
-				code: "ALREADY_INFECTED",
+				code: "",
 				message: `O personagem já está sob o efeito de ${diseaseType}.`,
 			});
killedBy: IllnessService - Integração e Testes de Patologias deve rejeitar duplicidade de infecção do mesmo tipo no mesmo personagem
statusReason: expected '' to be 'ALREADY_INFECTED' // Object.is equality

[Survived] StringLiteral
entities/character/domain/IllnessService.ts:92:14
 		if (alreadyInfected) {
 			return fail({
 				code: "ALREADY_INFECTED",
-				message: `O personagem já está sob o efeito de ${diseaseType}.`,
+				message: ``,
 			});
 		}

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:103:18
 			type: diseaseType,
 			severity: 2,
 			severityMax: 4,
-			isAggravated: false,
+			isAggravated: true,
 			createdAt: timestamp,
 		};
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:108:7
 		};
 
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
-		if (!savedResult.success) {
+		if (true) {
 			return fail({
 				code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias deve infectar um personagem com sucesso persistindo na tabela SQLite de status effects
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:108:7
 		};
 
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
-		if (!savedResult.success) {
+		if (false) {
 			return fail({
 				code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao infectar personagem se a gravação do status effect no repositório falhar
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/IllnessService.ts:109:16
 
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
 		if (!savedResult.success) {
-			return fail({
-				code: "PERSIST_STATUS_EFFECT_FAILED",
-				message: savedResult.error.message,
-			});
+			return fail({});
 		}
 
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao infectar personagem se a gravação do status effect no repositório falhar
statusReason: expected undefined to be 'PERSIST_STATUS_EFFECT_FAILED' // Object.is equality

[Killed] StringLiteral
entities/character/domain/IllnessService.ts:110:11
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
 		if (!savedResult.success) {
 			return fail({
-				code: "PERSIST_STATUS_EFFECT_FAILED",
+				code: "",
 				message: savedResult.error.message,
 			});
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao infectar personagem se a gravação do status effect no repositório falhar
statusReason: expected '' to be 'PERSIST_STATUS_EFFECT_FAILED' // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:128:32
 	): Promise<Result<void, CharacterFailure>> {
 		const existingResult =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!existingResult.success) {
-			return fail({
-				code: "FETCH_STATUS_EFFECTS_FAILED",
-				message: "Não foi possível buscar os efeitos para remoção.",
-			});
-		}
+		if (!existingResult.success) {}
 
 		const targetEffect = existingResult.data.find(
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao curar enfermidade se a busca pelos efeitos de status no repositório falhar
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:136:11
 		}
 
 		const targetEffect = existingResult.data.find(
-			(e) => e.type === diseaseType,
+			(e) => false,
 		);
 		if (!targetEffect) {
killedBy: IllnessService - Integração e Testes de Patologias deve curar uma infecção ativa com sucesso removendo-a da persistência
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
entities/character/domain/IllnessService.ts:136:4
 		}
 
 		const targetEffect = existingResult.data.find(
-			(e) => e.type === diseaseType,
+			() => undefined,
 		);
 		if (!targetEffect) {
killedBy: IllnessService - Integração e Testes de Patologias deve curar uma infecção ativa com sucesso removendo-a da persistência
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:138:7
 		const targetEffect = existingResult.data.find(
 			(e) => e.type === diseaseType,
 		);
-		if (!targetEffect) {
+		if (targetEffect) {
 			return fail({
 				code: "EFFECT_NOT_FOUND",
killedBy: IllnessService - Integração e Testes de Patologias deve curar uma infecção ativa com sucesso removendo-a da persistência
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:138:7
 		const targetEffect = existingResult.data.find(
 			(e) => e.type === diseaseType,
 		);
-		if (!targetEffect) {
+		if (true) {
 			return fail({
 				code: "EFFECT_NOT_FOUND",
killedBy: IllnessService - Integração e Testes de Patologias deve curar uma infecção ativa com sucesso removendo-a da persistência
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:148:7
 		const deletedResult = await this.repository.deleteStatusEffect(
 			targetEffect.id,
 		);
-		if (!deletedResult.success) {
+		if (false) {
 			return fail({
 				code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias deve falhar ao curar enfermidade se a deleção do status effect no repositório falhar
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:148:7
 		const deletedResult = await this.repository.deleteStatusEffect(
 			targetEffect.id,
 		);
-		if (!deletedResult.success) {
+		if (deletedResult.success) {
 			return fail({
 				code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias deve curar uma infecção ativa com sucesso removendo-a da persistência
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:170:7
 	> {
 		const existingResult =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!existingResult.success) {
+		if (existingResult.success) {
 			return fail({
 				code: "FETCH_STATUS_EFFECTS_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/IllnessService.ts:171:16
 		const existingResult =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
 		if (!existingResult.success) {
-			return fail({
-				code: "FETCH_STATUS_EFFECTS_FAILED",
-				message:
-					"Não foi possível carregar os efeitos de status do personagem.",
-			});
+			return fail({});
 		}
 
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve falhar se a busca no repositório retornar erro
statusReason: expected undefined to be 'FETCH_STATUS_EFFECTS_FAILED' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:182:8
 		let updatedCount = 0;
 
 		for (const effect of existingResult.data) {
-			if (effect.durationTurns !== undefined && effect.durationTurns !== null) {
+			if (true) {
 				const nextTurns = effect.durationTurns - 1;
 				if (nextTurns <= 0) {
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve ignorar efeitos que possuem duração indefinida (null ou undefined)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/IllnessService.ts:182:8
 		let updatedCount = 0;
 
 		for (const effect of existingResult.data) {
-			if (effect.durationTurns !== undefined && effect.durationTurns !== null) {
+			if (effect.durationTurns !== undefined || effect.durationTurns !== null) {
 				const nextTurns = effect.durationTurns - 1;
 				if (nextTurns <= 0) {
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve ignorar efeitos que possuem duração indefinida (null ou undefined)
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:183:23
 
 		for (const effect of existingResult.data) {
 			if (effect.durationTurns !== undefined && effect.durationTurns !== null) {
-				const nextTurns = effect.durationTurns - 1;
+				const nextTurns = effect.durationTurns + 1;
 				if (nextTurns <= 0) {
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:184:25
 		for (const effect of existingResult.data) {
 			if (effect.durationTurns !== undefined && effect.durationTurns !== null) {
 				const nextTurns = effect.durationTurns - 1;
-				if (nextTurns <= 0) {
-					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!deleteRes.success) {
-						return fail({
-							code: "DELETE_STATUS_EFFECT_FAILED",
-							message: deleteRes.error.message,
-						});
-					}
-					expiredCount++;
-				} else {
+				if (nextTurns <= 0) {} else {
 					const updatedEffect = {
 						...effect,
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve expirar e excluir o efeito se a duração chegar a 0 após o decremento
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:184:9
 		for (const effect of existingResult.data) {
 			if (effect.durationTurns !== undefined && effect.durationTurns !== null) {
 				const nextTurns = effect.durationTurns - 1;
-				if (nextTurns <= 0) {
+				if (nextTurns > 0) {
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
 					if (!deleteRes.success) {
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:186:10
 				const nextTurns = effect.durationTurns - 1;
 				if (nextTurns <= 0) {
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!deleteRes.success) {
+					if (deleteRes.success) {
 						return fail({
 							code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve expirar e excluir o efeito se a duração chegar a 0 após o decremento
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:186:10
 				const nextTurns = effect.durationTurns - 1;
 				if (nextTurns <= 0) {
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!deleteRes.success) {
+					if (true) {
 						return fail({
 							code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve expirar e excluir o efeito se a duração chegar a 0 após o decremento
statusReason: Cannot read properties of undefined (reading 'message')

[NoCoverage] ObjectLiteral
entities/character/domain/IllnessService.ts:187:19
 				if (nextTurns <= 0) {
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
 					if (!deleteRes.success) {
-						return fail({
-							code: "DELETE_STATUS_EFFECT_FAILED",
-							message: deleteRes.error.message,
-						});
+						return fail({});
 					}
 					expiredCount++;

[NoCoverage] StringLiteral
entities/character/domain/IllnessService.ts:188:14
 					const deleteRes = await this.repository.deleteStatusEffect(effect.id);
 					if (!deleteRes.success) {
 						return fail({
-							code: "DELETE_STATUS_EFFECT_FAILED",
+							code: "",
 							message: deleteRes.error.message,
 						});

[Killed] UpdateOperator
entities/character/domain/IllnessService.ts:192:6
 							message: deleteRes.error.message,
 						});
 					}
-					expiredCount++;
+					expiredCount--;
 				} else {
 					const updatedEffect = {
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve expirar e excluir o efeito se a duração chegar a 0 após o decremento
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:193:12
 						});
 					}
 					expiredCount++;
-				} else {
-					const updatedEffect = {
-						...effect,
-						durationTurns: nextTurns,
-						updatedAt: this.clock.now(),
-					};
-					const saveRes = await this.repository.saveStatusEffect(updatedEffect);
-					if (!saveRes.success) {
-						return fail({
-							code: "PERSIST_STATUS_EFFECT_FAILED",
-							message: saveRes.error.message,
-						});
-					}
-					updatedCount++;
-				}
+				} else {}
 			}
 		}
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:200:10
 						updatedAt: this.clock.now(),
 					};
 					const saveRes = await this.repository.saveStatusEffect(updatedEffect);
-					if (!saveRes.success) {
+					if (true) {
 						return fail({
 							code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:200:10
 						updatedAt: this.clock.now(),
 					};
 					const saveRes = await this.repository.saveStatusEffect(updatedEffect);
-					if (!saveRes.success) {
+					if (saveRes.success) {
 						return fail({
 							code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: Cannot read properties of undefined (reading 'message')

[NoCoverage] ObjectLiteral
entities/character/domain/IllnessService.ts:201:19
 					};
 					const saveRes = await this.repository.saveStatusEffect(updatedEffect);
 					if (!saveRes.success) {
-						return fail({
-							code: "PERSIST_STATUS_EFFECT_FAILED",
-							message: saveRes.error.message,
-						});
+						return fail({});
 					}
 					updatedCount++;

[Killed] UpdateOperator
entities/character/domain/IllnessService.ts:206:6
 							message: saveRes.error.message,
 						});
 					}
-					updatedCount++;
+					updatedCount--;
 				}
 			}
killedBy: IllnessService - Integração e Testes de Patologias decrementStatusEffectsDuration deve decrementar com sucesso a duração de um efeito tático ativo
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:227:4
 		modifier: number;
 		total: number;
 		success: boolean;
-	} {
-		// Regra de Pandorha: Modificador de Resistência = Nível + Físico + Resistência
-		const modifier =
-			characterStats.level +
-			characterStats.physical +
-			characterStats.resistance;
-		const total = d20Roll + modifier;
-		const success = total >= dc;
-
-		return {
-			roll: d20Roll,
-			modifier,
-			total,
-			success,
-		};
-	}
+	} {}
 
 	/**
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: Cannot read properties of undefined (reading 'roll')

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:230:4
 	} {
 		// Regra de Pandorha: Modificador de Resistência = Nível + Físico + Resistência
 		const modifier =
-			characterStats.level +
-			characterStats.physical +
+			characterStats.level - characterStats.physical +
 			characterStats.resistance;
 		const total = d20Roll + modifier;
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected 2 to be 8 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:230:4
 	} {
 		// Regra de Pandorha: Modificador de Resistência = Nível + Físico + Resistência
 		const modifier =
-			characterStats.level +
-			characterStats.physical +
-			characterStats.resistance;
+			characterStats.level + characterStats.physical - characterStats.resistance;
 		const total = d20Roll + modifier;
 		const success = total >= dc;
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected 2 to be 8 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:233:17
 			characterStats.level +
 			characterStats.physical +
 			characterStats.resistance;
-		const total = d20Roll + modifier;
+		const total = d20Roll - modifier;
 		const success = total >= dc;
 
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected 2 to be 18 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:234:19
 			characterStats.physical +
 			characterStats.resistance;
 		const total = d20Roll + modifier;
-		const success = total >= dc;
+		const success = false;
 
 		return {
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:234:19
 			characterStats.physical +
 			characterStats.resistance;
 		const total = d20Roll + modifier;
-		const success = total >= dc;
+		const success = total < dc;
 
 		return {
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/IllnessService.ts:236:10
 		const total = d20Roll + modifier;
 		const success = total >= dc;
 
-		return {
-			roll: d20Roll,
-			modifier,
-			total,
-			success,
-		};
+		return {};
 	}
 
killedBy: IllnessService - Integração e Testes de Patologias deve resolver rolagens de resistência de Vigor de forma matematicamente precisa
statusReason: expected undefined to be 10 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:271:7
 		>
 	> {
 		const charRes = await this.repository.findById(characterId);
-		if (!charRes.success) {
+		if (true) {
 			return fail({
 				code: "REPOSITORY_READ_FAILED",
killedBy: SurvivalService deve carregar rações do World State, consumir provisões diárias e salvar o restante
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:271:7
 		>
 	> {
 		const charRes = await this.repository.findById(characterId);
-		if (!charRes.success) {
+		if (charRes.success) {
 			return fail({
 				code: "REPOSITORY_READ_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: Cannot read properties of undefined (reading 'message')
