[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:280:7
 
 		const effectsRes =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!effectsRes.success) {
+		if (true) {
 			return fail({
 				code: "FETCH_STATUS_EFFECTS_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:280:7
 
 		const effectsRes =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!effectsRes.success) {
+		if (effectsRes.success) {
 			return fail({
 				code: "FETCH_STATUS_EFFECTS_FAILED",
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: expected 0 to be greater than 0

[NoCoverage] ObjectLiteral
entities/character/domain/IllnessService.ts:281:16
 		const effectsRes =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
 		if (!effectsRes.success) {
-			return fail({
-				code: "FETCH_STATUS_EFFECTS_FAILED",
-				message:
-					"Não foi possível carregar os efeitos de status do personagem.",
-			});
+			return fail({});
 		}
 

[Killed] ArrayDeclaration
entities/character/domain/IllnessService.ts:309:9
 			newSeverity: number;
 			curated: boolean;
 			isAggravated: boolean;
-		}[] = [];
+		}[] = ["Stryker was here"];
 
 		const illnesses = effectsRes.data.filter(
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: expected undefined to be 'eter_fever' // Object.is equality

[Survived] MethodExpression
entities/character/domain/IllnessService.ts:311:21
 			isAggravated: boolean;
 		}[] = [];
 
-		const illnesses = effectsRes.data.filter(
-			(e) =>
-				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
-				e.type === "viper_poison",
-		);
+		const illnesses = effectsRes.data;
 
 		for (const effect of illnesses) {

[Killed] ArrowFunction
entities/character/domain/IllnessService.ts:312:4
 		}[] = [];
 
 		const illnesses = effectsRes.data.filter(
-			(e) =>
-				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
-				e.type === "viper_poison",
+			() => undefined,
 		);
 
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/IllnessService.ts:313:5
 
 		const illnesses = effectsRes.data.filter(
 			(e) =>
-				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
+				e.type === "eter_fever" && e.type === "wound_infection" ||
 				e.type === "viper_poison",
 		);
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: expected 0 to be greater than 0

[Killed] LogicalOperator
entities/character/domain/IllnessService.ts:313:5
 
 		const illnesses = effectsRes.data.filter(
 			(e) =>
-				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
-				e.type === "viper_poison",
+				(e.type === "eter_fever" || e.type === "wound_infection") && e.type === "viper_poison",
 		);
 
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:314:5
 		const illnesses = effectsRes.data.filter(
 			(e) =>
 				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
+				false ||
 				e.type === "viper_poison",
 		);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:314:5
 		const illnesses = effectsRes.data.filter(
 			(e) =>
 				e.type === "eter_fever" ||
-				e.type === "wound_infection" ||
+				e.type !== "wound_infection" ||
 				e.type === "viper_poison",
 		);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:315:5
 			(e) =>
 				e.type === "eter_fever" ||
 				e.type === "wound_infection" ||
-				e.type === "viper_poison",
+				false,
 		);
 

[Survived] EqualityOperator
entities/character/domain/IllnessService.ts:315:5
 			(e) =>
 				e.type === "eter_fever" ||
 				e.type === "wound_infection" ||
-				e.type === "viper_poison",
+				e.type !== "viper_poison",
 		);
 

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:320:8
 
 		for (const effect of illnesses) {
 			let dc = 12;
-			if (effect.type === "eter_fever") dc = 14;
+			if (false) dc = 14;
 			else if (effect.type === "viper_poison") dc = 15;
 

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:320:8
 
 		for (const effect of illnesses) {
 			let dc = 12;
-			if (effect.type === "eter_fever") dc = 14;
+			if (true) dc = 14;
 			else if (effect.type === "viper_poison") dc = 15;
 

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:321:13
 		for (const effect of illnesses) {
 			let dc = 12;
 			if (effect.type === "eter_fever") dc = 14;
-			else if (effect.type === "viper_poison") dc = 15;
+			else if (true) dc = 15;
 
 			let roll = d20Roll;

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:321:13
 		for (const effect of illnesses) {
 			let dc = 12;
 			if (effect.type === "eter_fever") dc = 14;
-			else if (effect.type === "viper_poison") dc = 15;
+			else if (false) dc = 15;
 
 			let roll = d20Roll;

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:324:8
 			else if (effect.type === "viper_poison") dc = 15;
 
 			let roll = d20Roll;
-			if (roll === undefined) {
+			if (roll !== undefined) {
 				const arr = new Uint32Array(1);
 				if (typeof window !== "undefined" && window.crypto) {
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:324:8
 			else if (effect.type === "viper_poison") dc = 15;
 
 			let roll = d20Roll;
-			if (roll === undefined) {
+			if (true) {
 				const arr = new Uint32Array(1);
 				if (typeof window !== "undefined" && window.crypto) {
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:326:9
 			let roll = d20Roll;
 			if (roll === undefined) {
 				const arr = new Uint32Array(1);
-				if (typeof window !== "undefined" && window.crypto) {
+				if (typeof window === "undefined" && window.crypto) {
 					window.crypto.getRandomValues(arr);
 				} else {
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: window is not defined

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:326:9
 			let roll = d20Roll;
 			if (roll === undefined) {
 				const arr = new Uint32Array(1);
-				if (typeof window !== "undefined" && window.crypto) {
+				if (true) {
 					window.crypto.getRandomValues(arr);
 				} else {
killedBy: SurvivalService deve processar progressão de enfermidades no final do dia
statusReason: window is not defined

[Survived] BlockStatement
entities/character/domain/IllnessService.ts:328:12
 				const arr = new Uint32Array(1);
 				if (typeof window !== "undefined" && window.crypto) {
 					window.crypto.getRandomValues(arr);
-				} else {
-					// Fallback seguro em Node.js se global.crypto estiver disponível
-					const cryptoLib = await import("node:crypto");
-					cryptoLib.getRandomValues(arr);
-				}
+				} else {}
 				const val = arr[0];
 				roll = val !== undefined ? (val % 20) + 1 : 10;

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:334:12
 					cryptoLib.getRandomValues(arr);
 				}
 				const val = arr[0];
-				roll = val !== undefined ? (val % 20) + 1 : 10;
+				roll = true ? (val % 20) + 1 : 10;
 			}
 

[Survived] ConditionalExpression
entities/character/domain/IllnessService.ts:334:12
 					cryptoLib.getRandomValues(arr);
 				}
 				const val = arr[0];
-				roll = val !== undefined ? (val % 20) + 1 : 10;
+				roll = false ? (val % 20) + 1 : 10;
 			}
 

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:340:18
 			const rollRes = this.rollResistanceTest(decoratedStats, dc, roll);
 			const oldSeverity = effect.severity;
 			let newSeverity = oldSeverity;
-			let curated = false;
+			let curated = true;
 			let isAggravated = effect.isAggravated;
 
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:343:8
 			let curated = false;
 			let isAggravated = effect.isAggravated;
 
-			if (rollRes.success) {
+			if (true) {
 				newSeverity = Math.max(0, oldSeverity - 1);
 				if (newSeverity === 0) {
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:343:8
 			let curated = false;
 			let isAggravated = effect.isAggravated;
 
-			if (rollRes.success) {
+			if (false) {
 				newSeverity = Math.max(0, oldSeverity - 1);
 				if (newSeverity === 0) {
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:344:31
 			let isAggravated = effect.isAggravated;
 
 			if (rollRes.success) {
-				newSeverity = Math.max(0, oldSeverity - 1);
+				newSeverity = Math.max(0, oldSeverity + 1);
 				if (newSeverity === 0) {
 					const delRes = await this.repository.deleteStatusEffect(effect.id);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected 3 to be 1 // Object.is equality

[Killed] MethodExpression
entities/character/domain/IllnessService.ts:344:19
 			let isAggravated = effect.isAggravated;
 
 			if (rollRes.success) {
-				newSeverity = Math.max(0, oldSeverity - 1);
+				newSeverity = Math.min(0, oldSeverity - 1);
 				if (newSeverity === 0) {
 					const delRes = await this.repository.deleteStatusEffect(effect.id);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:345:9
 
 			if (rollRes.success) {
 				newSeverity = Math.max(0, oldSeverity - 1);
-				if (newSeverity === 0) {
+				if (newSeverity !== 0) {
 					const delRes = await this.repository.deleteStatusEffect(effect.id);
 					if (!delRes.success) {
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:345:28
 
 			if (rollRes.success) {
 				newSeverity = Math.max(0, oldSeverity - 1);
-				if (newSeverity === 0) {
-					const delRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!delRes.success) {
-						return fail({
-							code: "DELETE_STATUS_EFFECT_FAILED",
-							message: delRes.error.message,
-						});
-					}
-					curated = true;
-				} else {
+				if (newSeverity === 0) {} else {
 					effect.severity = newSeverity;
 					const saveRes = await this.repository.saveStatusEffect(effect);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:347:10
 				newSeverity = Math.max(0, oldSeverity - 1);
 				if (newSeverity === 0) {
 					const delRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!delRes.success) {
+					if (true) {
 						return fail({
 							code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:347:10
 				newSeverity = Math.max(0, oldSeverity - 1);
 				if (newSeverity === 0) {
 					const delRes = await this.repository.deleteStatusEffect(effect.id);
-					if (!delRes.success) {
+					if (delRes.success) {
 						return fail({
 							code: "DELETE_STATUS_EFFECT_FAILED",
killedBy: SurvivalService deve usar DiceService e IllnessService padrões se não forem fornecidos
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:353:16
 							message: delRes.error.message,
 						});
 					}
-					curated = true;
+					curated = false;
 				} else {
 					effect.severity = newSeverity;
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:354:12
 						});
 					}
 					curated = true;
-				} else {
-					effect.severity = newSeverity;
-					const saveRes = await this.repository.saveStatusEffect(effect);
-					if (!saveRes.success) {
-						return fail({
-							code: "PERSIST_STATUS_EFFECT_FAILED",
-							message: saveRes.error.message,
-						});
-					}
-				}
+				} else {}
 			} else {
 				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:357:10
 				} else {
 					effect.severity = newSeverity;
 					const saveRes = await this.repository.saveStatusEffect(effect);
-					if (!saveRes.success) {
+					if (saveRes.success) {
 						return fail({
 							code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:357:10
 				} else {
 					effect.severity = newSeverity;
 					const saveRes = await this.repository.saveStatusEffect(effect);
-					if (!saveRes.success) {
+					if (true) {
 						return fail({
 							code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve reduzir a gravidade da doença e curar se chegar a 0 após sucesso no vigor
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
entities/character/domain/IllnessService.ts:364:11
 						});
 					}
 				}
-			} else {
-				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
-				if (newSeverity === effect.severityMax) {
-					isAggravated = true;
-				}
-				effect.severity = newSeverity;
-				effect.isAggravated = isAggravated;
-				const saveRes = await this.repository.saveStatusEffect(effect);
-				if (!saveRes.success) {
-					return fail({
-						code: "PERSIST_STATUS_EFFECT_FAILED",
-						message: saveRes.error.message,
-					});
-				}
-			}
+			} else {}
 
 			results.push({
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected 2 to be 3 // Object.is equality

[Killed] MethodExpression
entities/character/domain/IllnessService.ts:365:19
 					}
 				}
 			} else {
-				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
+				newSeverity = Math.max(effect.severityMax, oldSeverity + 1);
 				if (newSeverity === effect.severityMax) {
 					isAggravated = true;
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected 4 to be 3 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/IllnessService.ts:365:48
 					}
 				}
 			} else {
-				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
+				newSeverity = Math.min(effect.severityMax, oldSeverity - 1);
 				if (newSeverity === effect.severityMax) {
 					isAggravated = true;
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected 1 to be 3 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/IllnessService.ts:366:9
 				}
 			} else {
 				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
-				if (newSeverity === effect.severityMax) {
+				if (newSeverity !== effect.severityMax) {
 					isAggravated = true;
 				}
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/IllnessService.ts:366:9
 				}
 			} else {
 				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
-				if (newSeverity === effect.severityMax) {
+				if (true) {
 					isAggravated = true;
 				}
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/IllnessService.ts:367:21
 			} else {
 				newSeverity = Math.min(effect.severityMax, oldSeverity + 1);
 				if (newSeverity === effect.severityMax) {
-					isAggravated = true;
+					isAggravated = false;
 				}
 				effect.severity = newSeverity;
killedBy: IllnessService - Integração e Testes de Patologias processWeeklyIllnessProgress deve aumentar a gravidade da doença e agravar se atingir o limite após falha no vigor
statusReason: expected false to be true // Object.is equality
