[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:57:32
 		private readonly characterClass: { id: string; baseHp: number },
 	) {}
 
-	public get physical(): number {
-		return this.character.physical;
-	}
+	public get physical(): number {}
 
 	public get mental(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: NaN, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:61:30
 		return this.character.physical;
 	}
 
-	public get mental(): number {
-		return this.character.mental;
-	}
+	public get mental(): number {}
 
 	public get social(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:65:30
 		return this.character.mental;
 	}
 
-	public get social(): number {
-		return this.character.social;
-	}
+	public get social(): number {}
 
 	public get conflict(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:69:32
 		return this.character.social;
 	}
 
-	public get conflict(): number {
-		return this.character.conflict;
-	}
+	public get conflict(): number {}
 
 	public get interaction(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected NaN to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:73:35
 		return this.character.conflict;
 	}
 
-	public get interaction(): number {
-		return this.character.interaction;
-	}
+	public get interaction(): number {}
 
 	public get resistance(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:77:34
 		return this.character.interaction;
 	}
 
-	public get resistance(): number {
-		return this.character.resistance;
-	}
+	public get resistance(): number {}
 
 	public get level(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: NaN, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:81:29
 		return this.character.resistance;
 	}
 
-	public get level(): number {
-		return this.character.level;
-	}
+	public get level(): number {}
 
 	public get classBaseHp(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:85:35
 		return this.character.level;
 	}
 
-	public get classBaseHp(): number {
-		return this.characterClass.baseHp;
-	}
+	public get classBaseHp(): number {}
 
 	// Regra de RPG: HP = (Base HP + Físico + Resistência) * Nível
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:90:29
 	}
 
 	// Regra de RPG: HP = (Base HP + Físico + Resistência) * Nível
-	public get maxHp(): number {
-		return (this.classBaseHp + this.physical + this.resistance) * this.level;
-	}
+	public get maxHp(): number {}
 
 	public get maxEe(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:91:11
 
 	// Regra de RPG: HP = (Base HP + Físico + Resistência) * Nível
 	public get maxHp(): number {
-		return (this.classBaseHp + this.physical + this.resistance) * this.level;
+		return (this.classBaseHp - this.physical + this.resistance) * this.level;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve calcular estatísticas base sem nenhum decorador ativo
statusReason: expected 10 to be 16 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:91:10
 
 	// Regra de RPG: HP = (Base HP + Físico + Resistência) * Nível
 	public get maxHp(): number {
-		return (this.classBaseHp + this.physical + this.resistance) * this.level;
+		return (this.classBaseHp + this.physical + this.resistance) / this.level;
 	}
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 8 to be 32 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:94:29
 		return (this.classBaseHp + this.physical + this.resistance) * this.level;
 	}
 
-	public get maxEe(): number {
-		return this.level + this.mental;
-	}
+	public get maxEe(): number {}
 
 	// Regra de RPG: Iniciativa = Nível + Mental + Interação
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:95:10
 	}
 
 	public get maxEe(): number {
-		return this.level + this.mental;
+		return this.level - this.mental;
 	}
 
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected -2 to be 4 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:99:38
 	}
 
 	// Regra de RPG: Iniciativa = Nível + Mental + Interação
-	public get initiativeBase(): number {
-		return this.level + this.mental + this.interaction;
-	}
+	public get initiativeBase(): number {}
 
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:100:10
 
 	// Regra de RPG: Iniciativa = Nível + Mental + Interação
 	public get initiativeBase(): number {
-		return this.level + this.mental + this.interaction;
+		return this.level - this.mental + this.interaction;
 	}
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 1 to be 5 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:100:10
 
 	// Regra de RPG: Iniciativa = Nível + Mental + Interação
 	public get initiativeBase(): number {
-		return this.level + this.mental + this.interaction;
+		return this.level + this.mental - this.interaction;
 	}
 
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:104:38
 	}
 
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
-	public get carrySlotLimit(): number {
-		const bonus = this.character.ancestryId === "dwarf" ? 2 : 0;
-		return this.physical + this.resistance + 6 + bonus;
-	}
+	public get carrySlotLimit(): number {}
 
 	// Velocidade base em metros (Pandorha padrão: 9m)
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: NaN, …(13) } to deeply equal { …(14) }

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:105:17
 
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
 	public get carrySlotLimit(): number {
-		const bonus = this.character.ancestryId === "dwarf" ? 2 : 0;
+		const bonus = false ? 2 : 0;
 		return this.physical + this.resistance + 6 + bonus;
 	}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve conceder bônus de ancestralidade Anão (+2 slots de carga)
statusReason: expected 12 to be 14 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/StatusEffectDecorator.ts:105:17
 
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
 	public get carrySlotLimit(): number {
-		const bonus = this.character.ancestryId === "dwarf" ? 2 : 0;
+		const bonus = this.character.ancestryId !== "dwarf" ? 2 : 0;
 		return this.physical + this.resistance + 6 + bonus;
 	}
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 12, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:106:10
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
 	public get carrySlotLimit(): number {
 		const bonus = this.character.ancestryId === "dwarf" ? 2 : 0;
-		return this.physical + this.resistance + 6 + bonus;
+		return this.physical - this.resistance + 6 + bonus;
 	}
 
killedBy: InventoryPanel (UI Reativa Svelte 5) deve recalcular a capacidade e o peso total ao desequipar um item
statusReason: expected '15 / 6 Slots' to contain '5 / 10 Slots'

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:106:10
 	// Regra de RPG: Carga = Físico + Resistência + 6 + (2 se for Anão - Mule do Abismo)
 	public get carrySlotLimit(): number {
 		const bonus = this.character.ancestryId === "dwarf" ? 2 : 0;
-		return this.physical + this.resistance + 6 + bonus;
+		return this.physical + this.resistance - 6 + bonus;
 	}
 
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: -2, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:110:41
 	}
 
 	// Velocidade base em metros (Pandorha padrão: 9m)
-	public get movementSpeedBase(): number {
-		return 9;
-	}
+	public get movementSpeedBase(): number {}
 
 	// Regra de RPG: CA base sem armadura = 10 + Nível + Físico
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:115:34
 	}
 
 	// Regra de RPG: CA base sem armadura = 10 + Nível + Físico
-	public get armorClass(): number {
-		return 10 + this.level + this.physical;
-	}
+	public get armorClass(): number {}
 
 	public get stealthPenalty(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve calcular estatísticas base sem nenhum decorador ativo
statusReason: expected undefined to be 14 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:116:10
 
 	// Regra de RPG: CA base sem armadura = 10 + Nível + Físico
 	public get armorClass(): number {
-		return 10 + this.level + this.physical;
+		return 10 - this.level + this.physical;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve calcular estatísticas base sem nenhum decorador ativo
statusReason: expected 12 to be 14 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:116:10
 
 	// Regra de RPG: CA base sem armadura = 10 + Nível + Físico
 	public get armorClass(): number {
-		return 10 + this.level + this.physical;
+		return 10 + this.level - this.physical;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve calcular estatísticas base sem nenhum decorador ativo
statusReason: expected 8 to be 14 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:119:38
 		return 10 + this.level + this.physical;
 	}
 
-	public get stealthPenalty(): number {
-		return 0;
-	}
+	public get stealthPenalty(): number {}
 
 	public get currentCarryWeight(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve calcular estatísticas base sem nenhum decorador ativo
statusReason: expected undefined to be +0 // Object.is equality

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:123:42
 		return 0;
 	}
 
-	public get currentCarryWeight(): number {
-		return 0;
-	}
+	public get currentCarryWeight(): number {}
 
 	public get encumbranceState(): "light" | "encumbered" | "overloaded" {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:127:71
 		return 0;
 	}
 
-	public get encumbranceState(): "light" | "encumbered" | "overloaded" {
-		return "light";
-	}
+	public get encumbranceState(): "light" | "encumbered" | "overloaded" {}
 
 	// Por padrão, um personagem saudável pode se recuperar normalmente no acampamento

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:132:46
 	}
 
 	// Por padrão, um personagem saudável pode se recuperar normalmente no acampamento
-	public get allowsNaturalRecovery(): boolean {
-		return true;
-	}
+	public get allowsNaturalRecovery(): boolean {}
 
 	public get size(): "medium" | "large" {
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:133:10
 
 	// Por padrão, um personagem saudável pode se recuperar normalmente no acampamento
 	public get allowsNaturalRecovery(): boolean {
-		return true;
+		return false;
 	}
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected false to be true // Object.is equality

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:136:40
 		return true;
 	}
 
-	public get size(): "medium" | "large" {
-		return "medium";
-	}
+	public get size(): "medium" | "large" {}
 
 	public get weaponDamageBonus(): number {

[NoCoverage] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:137:10
 	}
 
 	public get size(): "medium" | "large" {
-		return "medium";
+		return "";
 	}
 

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:140:41
 		return "medium";
 	}
 
-	public get weaponDamageBonus(): number {
-		return 0;
-	}
+	public get weaponDamageBonus(): number {}
 
 	public get extraActions(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected NaN to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:144:36
 		return 0;
 	}
 
-	public get extraActions(): number {
-		return 0;
-	}
+	public get extraActions(): number {}
 
 	public get attackBonus(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar SurtoTempoDecorator com aumento de ações e bônus no eixo físico
statusReason: expected NaN to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:148:35
 		return 0;
 	}
 
-	public get attackBonus(): number {
-		return 0;
-	}
+	public get attackBonus(): number {}
 
 	public get ignoresDifficultTerrain(): boolean {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar CacadaSelvagemDecorator com bônus de ataque e imunidade a terreno difícil
statusReason: expected NaN to be 5 // Object.is equality

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:152:48
 		return 0;
 	}
 
-	public get ignoresDifficultTerrain(): boolean {
-		return false;
-	}
+	public get ignoresDifficultTerrain(): boolean {}
 
 	public get automaticDefenseFailure(): boolean {

[NoCoverage] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:153:10
 	}
 
 	public get ignoresDifficultTerrain(): boolean {
-		return false;
+		return true;
 	}
 

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:156:48
 		return false;
 	}
 
-	public get automaticDefenseFailure(): boolean {
-		return false;
-	}
+	public get automaticDefenseFailure(): boolean {}
 
 	public get hasLatentDiscoordination(): boolean {

[NoCoverage] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:157:10
 	}
 
 	public get automaticDefenseFailure(): boolean {
-		return false;
+		return true;
 	}
 

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:160:49
 		return false;
 	}
 
-	public get hasLatentDiscoordination(): boolean {
-		return false;
-	}
+	public get hasLatentDiscoordination(): boolean {}
 
 	public get latentDiscoordinationAxis(): string | null {

[NoCoverage] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:161:10
 	}
 
 	public get hasLatentDiscoordination(): boolean {
-		return false;
+		return true;
 	}
 

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:164:56
 		return false;
 	}
 
-	public get latentDiscoordinationAxis(): string | null {
-		return null;
-	}
+	public get latentDiscoordinationAxis(): string | null {}
 
 	public get latentDiscoordinationTestsLeft(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:168:54
 		return null;
 	}
 
-	public get latentDiscoordinationTestsLeft(): number {
-		return 0;
-	}
+	public get latentDiscoordinationTestsLeft(): number {}
 }
 

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:183:32
 export abstract class StatusEffectDecorator implements ICharacterStats {
 	public constructor(protected readonly wrapped: ICharacterStats) {}
 
-	public get physical(): number {
-		return this.wrapped.physical;
-	}
+	public get physical(): number {}
 
 	public get mental(): number {
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected NaN to be +0 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:187:30
 		return this.wrapped.physical;
 	}
 
-	public get mental(): number {
-		return this.wrapped.mental;
-	}
+	public get mental(): number {}
 
 	public get social(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:191:30
 		return this.wrapped.mental;
 	}
 
-	public get social(): number {
-		return this.wrapped.social;
-	}
+	public get social(): number {}
 
 	public get conflict(): number {
killedBy: createCharacterListView maps character records to readable list items
statusReason: expected [ { id: 'character-kael', …(11) } ] to deeply equal [ { id: 'character-kael', …(11) } ]

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:195:32
 		return this.wrapped.social;
 	}
 
-	public get conflict(): number {
-		return this.wrapped.conflict;
-	}
+	public get conflict(): number {}
 
 	public get interaction(): number {
killedBy: createCharacterListView maps character records to readable list items
statusReason: expected [ { id: 'character-kael', …(11) } ] to deeply equal [ { id: 'character-kael', …(11) } ]

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:199:35
 		return this.wrapped.conflict;
 	}
 
-	public get interaction(): number {
-		return this.wrapped.interaction;
-	}
+	public get interaction(): number {}
 
 	public get resistance(): number {
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected NaN to be 3 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:203:34
 		return this.wrapped.interaction;
 	}
 
-	public get resistance(): number {
-		return this.wrapped.resistance;
-	}
+	public get resistance(): number {}
 
 	public get level(): number {
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:207:29
 		return this.wrapped.resistance;
 	}
 
-	public get level(): number {
-		return this.wrapped.level;
-	}
+	public get level(): number {}
 
 	public get classBaseHp(): number {
killedBy: createCharacterListView maps character records to readable list items
statusReason: expected [ { id: 'character-kael', …(11) } ] to deeply equal [ { id: 'character-kael', …(11) } ]

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:211:35
 		return this.wrapped.level;
 	}
 
-	public get classBaseHp(): number {
-		return this.wrapped.classBaseHp;
-	}
+	public get classBaseHp(): number {}
 
 	// Reatividade Cebola: usa as propriedades do decorador (this) em vez do embrulhado (wrapped), somando os ajustes customizados do wrapped
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:216:29
 	}
 
 	// Reatividade Cebola: usa as propriedades do decorador (this) em vez do embrulhado (wrapped), somando os ajustes customizados do wrapped
-	public get maxHp(): number {
-		const baseFromAttributes =
-			(this.classBaseHp + this.physical + this.resistance) * this.level;
-		const wrappedFromAttributes =
-			(this.wrapped.classBaseHp +
-				this.wrapped.physical +
-				this.wrapped.resistance) *
-			this.wrapped.level;
-		const adjustment = this.wrapped.maxHp - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
-	}
+	public get maxHp(): number {}
 
 	public get maxEe(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected NaN to be 8 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:218:5
 	// Reatividade Cebola: usa as propriedades do decorador (this) em vez do embrulhado (wrapped), somando os ajustes customizados do wrapped
 	public get maxHp(): number {
 		const baseFromAttributes =
-			(this.classBaseHp + this.physical + this.resistance) * this.level;
+			(this.classBaseHp + this.physical - this.resistance) * this.level;
 		const wrappedFromAttributes =
 			(this.wrapped.classBaseHp +
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected +0 to be 24 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:218:5
 	// Reatividade Cebola: usa as propriedades do decorador (this) em vez do embrulhado (wrapped), somando os ajustes customizados do wrapped
 	public get maxHp(): number {
 		const baseFromAttributes =
-			(this.classBaseHp + this.physical + this.resistance) * this.level;
+			(this.classBaseHp - this.physical + this.resistance) * this.level;
 		const wrappedFromAttributes =
 			(this.wrapped.classBaseHp +
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:220:5
 		const baseFromAttributes =
 			(this.classBaseHp + this.physical + this.resistance) * this.level;
 		const wrappedFromAttributes =
-			(this.wrapped.classBaseHp +
-				this.wrapped.physical +
-				this.wrapped.resistance) *
+			(this.wrapped.classBaseHp + this.wrapped.physical - this.wrapped.resistance) *
 			this.wrapped.level;
 		const adjustment = this.wrapped.maxHp - wrappedFromAttributes;
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:220:5
 		const baseFromAttributes =
 			(this.classBaseHp + this.physical + this.resistance) * this.level;
 		const wrappedFromAttributes =
-			(this.wrapped.classBaseHp +
-				this.wrapped.physical +
+			(this.wrapped.classBaseHp - this.wrapped.physical +
 				this.wrapped.resistance) *
 			this.wrapped.level;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Febre de Éter (EterFeverDecorator) reduzindo mental e resistance e recalculando maxHp
statusReason: expected 42 to be 30 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:224:22
 				this.wrapped.physical +
 				this.wrapped.resistance) *
 			this.wrapped.level;
-		const adjustment = this.wrapped.maxHp - wrappedFromAttributes;
+		const adjustment = this.wrapped.maxHp + wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
 	}
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 204 to be 24 // Object.is equality

[Survived] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:225:10
 				this.wrapped.resistance) *
 			this.wrapped.level;
 		const adjustment = this.wrapped.maxHp - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
+		return baseFromAttributes - adjustment;
 	}
 

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:228:29
 		return baseFromAttributes + adjustment;
 	}
 
-	public get maxEe(): number {
-		const baseFromAttributes = this.level + this.mental;
-		const wrappedFromAttributes = this.wrapped.level + this.wrapped.mental;
-		const adjustment = this.wrapped.maxEe - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
-	}
+	public get maxEe(): number {}
 
 	public get initiativeBase(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected NaN to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:229:30
 	}
 
 	public get maxEe(): number {
-		const baseFromAttributes = this.level + this.mental;
+		const baseFromAttributes = this.level - this.mental;
 		const wrappedFromAttributes = this.wrapped.level + this.wrapped.mental;
 		const adjustment = this.wrapped.maxEe - wrappedFromAttributes;
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected -1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:230:33
 
 	public get maxEe(): number {
 		const baseFromAttributes = this.level + this.mental;
-		const wrappedFromAttributes = this.wrapped.level + this.wrapped.mental;
+		const wrappedFromAttributes = this.wrapped.level - this.wrapped.mental;
 		const adjustment = this.wrapped.maxEe - wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 5 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:231:22
 	public get maxEe(): number {
 		const baseFromAttributes = this.level + this.mental;
 		const wrappedFromAttributes = this.wrapped.level + this.wrapped.mental;
-		const adjustment = this.wrapped.maxEe - wrappedFromAttributes;
+		const adjustment = this.wrapped.maxEe + wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
 	}
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 6 to be 2 // Object.is equality

[Survived] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:232:10
 		const baseFromAttributes = this.level + this.mental;
 		const wrappedFromAttributes = this.wrapped.level + this.wrapped.mental;
 		const adjustment = this.wrapped.maxEe - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
+		return baseFromAttributes - adjustment;
 	}
 
