[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:235:38
 		return baseFromAttributes + adjustment;
 	}
 
-	public get initiativeBase(): number {
-		const baseFromAttributes = this.level + this.mental + this.interaction;
-		const wrappedFromAttributes =
-			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
-		const adjustment = this.wrapped.initiativeBase - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
-	}
+	public get initiativeBase(): number {}
 
 	// Reatividade de Carga: recalcula com os atributos flutuantes na cebola mas preserva o bônus de anão original do wrapped
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:236:30
 	}
 
 	public get initiativeBase(): number {
-		const baseFromAttributes = this.level + this.mental + this.interaction;
+		const baseFromAttributes = this.level + this.mental - this.interaction;
 		const wrappedFromAttributes =
 			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:236:30
 	}
 
 	public get initiativeBase(): number {
-		const baseFromAttributes = this.level + this.mental + this.interaction;
+		const baseFromAttributes = this.level - this.mental + this.interaction;
 		const wrappedFromAttributes =
 			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected +0 to be 3 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:238:4
 	public get initiativeBase(): number {
 		const baseFromAttributes = this.level + this.mental + this.interaction;
 		const wrappedFromAttributes =
-			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
+			this.wrapped.level + this.wrapped.mental - this.wrapped.interaction;
 		const adjustment = this.wrapped.initiativeBase - wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:238:4
 	public get initiativeBase(): number {
 		const baseFromAttributes = this.level + this.mental + this.interaction;
 		const wrappedFromAttributes =
-			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
+			this.wrapped.level - this.wrapped.mental + this.wrapped.interaction;
 		const adjustment = this.wrapped.initiativeBase - wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Febre de Éter (EterFeverDecorator) reduzindo mental e resistance e recalculando maxHp
statusReason: expected 8 to be 4 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:239:22
 		const baseFromAttributes = this.level + this.mental + this.interaction;
 		const wrappedFromAttributes =
 			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
-		const adjustment = this.wrapped.initiativeBase - wrappedFromAttributes;
+		const adjustment = this.wrapped.initiativeBase + wrappedFromAttributes;
 		return baseFromAttributes + adjustment;
 	}
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 29 to be 3 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:240:10
 		const wrappedFromAttributes =
 			this.wrapped.level + this.wrapped.mental + this.wrapped.interaction;
 		const adjustment = this.wrapped.initiativeBase - wrappedFromAttributes;
-		return baseFromAttributes + adjustment;
+		return baseFromAttributes - adjustment;
 	}
 
killedBy: createCombatAttackerStatsView shows derived stats with encumbered penalty (-2 initiative)
statusReason: expected 'Iniciativa: 7' to be 'Iniciativa: 3' // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:244:38
 	}
 
 	// Reatividade de Carga: recalcula com os atributos flutuantes na cebola mas preserva o bônus de anão original do wrapped
-	public get carrySlotLimit(): number {
-		const originalBaseLimit = this.wrapped.carrySlotLimit;
-		const originalAttributesSum =
-			this.wrapped.physical + this.wrapped.resistance + 6;
-		const fixedBonus = originalBaseLimit - originalAttributesSum;
-		return this.physical + this.resistance + 6 + fixedBonus;
-	}
+	public get carrySlotLimit(): number {}
 
 	public get movementSpeedBase(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: undefined, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:247:4
 	public get carrySlotLimit(): number {
 		const originalBaseLimit = this.wrapped.carrySlotLimit;
 		const originalAttributesSum =
-			this.wrapped.physical + this.wrapped.resistance + 6;
+			this.wrapped.physical - this.wrapped.resistance + 6;
 		const fixedBonus = originalBaseLimit - originalAttributesSum;
 		return this.physical + this.resistance + 6 + fixedBonus;
killedBy: InventoryPanel (UI Reativa Svelte 5) deve recalcular a capacidade e o peso total ao desequipar um item
statusReason: expected '15 / 14 Slots' to contain '5 / 10 Slots'

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:247:4
 	public get carrySlotLimit(): number {
 		const originalBaseLimit = this.wrapped.carrySlotLimit;
 		const originalAttributesSum =
-			this.wrapped.physical + this.wrapped.resistance + 6;
+			this.wrapped.physical + this.wrapped.resistance - 6;
 		const fixedBonus = originalBaseLimit - originalAttributesSum;
 		return this.physical + this.resistance + 6 + fixedBonus;
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 34, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:248:22
 		const originalBaseLimit = this.wrapped.carrySlotLimit;
 		const originalAttributesSum =
 			this.wrapped.physical + this.wrapped.resistance + 6;
-		const fixedBonus = originalBaseLimit - originalAttributesSum;
+		const fixedBonus = originalBaseLimit + originalAttributesSum;
 		return this.physical + this.resistance + 6 + fixedBonus;
 	}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 'light' to be 'encumbered' // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:249:10
 		const originalAttributesSum =
 			this.wrapped.physical + this.wrapped.resistance + 6;
 		const fixedBonus = originalBaseLimit - originalAttributesSum;
-		return this.physical + this.resistance + 6 + fixedBonus;
+		return this.physical + this.resistance + 6 - fixedBonus;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve encolher a capacidade de carga de forma reativa se doenças afetarem atributos
statusReason: expected 9 to be 13 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:249:10
 		const originalAttributesSum =
 			this.wrapped.physical + this.wrapped.resistance + 6;
 		const fixedBonus = originalBaseLimit - originalAttributesSum;
-		return this.physical + this.resistance + 6 + fixedBonus;
+		return this.physical - this.resistance + 6 + fixedBonus;
 	}
 
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 2, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:252:41
 		return this.physical + this.resistance + 6 + fixedBonus;
 	}
 
-	public get movementSpeedBase(): number {
-		return this.wrapped.movementSpeedBase;
-	}
+	public get movementSpeedBase(): number {}
 
 	public get armorClass(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected NaN to be 4 // Object.is equality

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:256:34
 		return this.wrapped.movementSpeedBase;
 	}
 
-	public get armorClass(): number {
-		return this.wrapped.armorClass;
-	}
+	public get armorClass(): number {}
 
 	public get stealthPenalty(): number {

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:260:38
 		return this.wrapped.armorClass;
 	}
 
-	public get stealthPenalty(): number {
-		return this.wrapped.stealthPenalty;
-	}
+	public get stealthPenalty(): number {}
 
 	public get currentCarryWeight(): number {
killedBy: createCharacterListView maps character records to readable list items
statusReason: expected [ { id: 'character-kael', …(11) } ] to deeply equal [ { id: 'character-kael', …(11) } ]

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:264:42
 		return this.wrapped.stealthPenalty;
 	}
 
-	public get currentCarryWeight(): number {
-		return this.wrapped.currentCarryWeight;
-	}
+	public get currentCarryWeight(): number {}
 
 	public get encumbranceState(): "light" | "encumbered" | "overloaded" {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:268:71
 		return this.wrapped.currentCarryWeight;
 	}
 
-	public get encumbranceState(): "light" | "encumbered" | "overloaded" {
-		return this.wrapped.encumbranceState;
-	}
+	public get encumbranceState(): "light" | "encumbered" | "overloaded" {}
 
 	public get allowsNaturalRecovery(): boolean {
killedBy: CombatEncounterPanel (UI Reativa Svelte 5) deve montar e renderizar os nomes dos personagens de teste no DOM
statusReason: Cannot read properties of undefined (reading 'toUpperCase')

	in <unknown>

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:272:46
 		return this.wrapped.encumbranceState;
 	}
 
-	public get allowsNaturalRecovery(): boolean {
-		return this.wrapped.allowsNaturalRecovery;
-	}
+	public get allowsNaturalRecovery(): boolean {}
 
 	public get size(): "medium" | "large" {
killedBy: createCharacterListView maps character records to readable list items
statusReason: expected [ { id: 'character-kael', …(11) } ] to deeply equal [ { id: 'character-kael', …(11) } ]

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:276:40
 		return this.wrapped.allowsNaturalRecovery;
 	}
 
-	public get size(): "medium" | "large" {
-		return this.wrapped.size;
-	}
+	public get size(): "medium" | "large" {}
 
 	public get weaponDamageBonus(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:280:41
 		return this.wrapped.size;
 	}
 
-	public get weaponDamageBonus(): number {
-		return this.wrapped.weaponDamageBonus;
-	}
+	public get weaponDamageBonus(): number {}
 
 	public get extraActions(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:284:36
 		return this.wrapped.weaponDamageBonus;
 	}
 
-	public get extraActions(): number {
-		return this.wrapped.extraActions;
-	}
+	public get extraActions(): number {}
 
 	public get attackBonus(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:288:35
 		return this.wrapped.extraActions;
 	}
 
-	public get attackBonus(): number {
-		return this.wrapped.attackBonus;
-	}
+	public get attackBonus(): number {}
 
 	public get ignoresDifficultTerrain(): boolean {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:292:48
 		return this.wrapped.attackBonus;
 	}
 
-	public get ignoresDifficultTerrain(): boolean {
-		return this.wrapped.ignoresDifficultTerrain;
-	}
+	public get ignoresDifficultTerrain(): boolean {}
 
 	public get automaticDefenseFailure(): boolean {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:296:48
 		return this.wrapped.ignoresDifficultTerrain;
 	}
 
-	public get automaticDefenseFailure(): boolean {
-		return this.wrapped.automaticDefenseFailure;
-	}
+	public get automaticDefenseFailure(): boolean {}
 
 	public get hasLatentDiscoordination(): boolean {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:300:49
 		return this.wrapped.automaticDefenseFailure;
 	}
 
-	public get hasLatentDiscoordination(): boolean {
-		return this.wrapped.hasLatentDiscoordination;
-	}
+	public get hasLatentDiscoordination(): boolean {}
 
 	public get latentDiscoordinationAxis(): string | null {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:304:56
 		return this.wrapped.hasLatentDiscoordination;
 	}
 
-	public get latentDiscoordinationAxis(): string | null {
-		return this.wrapped.latentDiscoordinationAxis;
-	}
+	public get latentDiscoordinationAxis(): string | null {}
 
 	public get latentDiscoordinationTestsLeft(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:308:54
 		return this.wrapped.latentDiscoordinationAxis;
 	}
 
-	public get latentDiscoordinationTestsLeft(): number {
-		return this.wrapped.latentDiscoordinationTestsLeft;
-	}
+	public get latentDiscoordinationTestsLeft(): number {}
 }
 

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:319:39
  * Reduz: mental -1, resistance -1.
  */
 export class EterFeverDecorator extends StatusEffectDecorator {
-	public override get mental(): number {
-		return Math.max(0, this.wrapped.mental - 1);
-	}
+	public override get mental(): number {}
 
 	public override get resistance(): number {
killedBy: createCharacterListView applies status effect decorators (Eter Fever) and recalculates stats dynamically
statusReason: expected { label: 'Mental', …(2) } to deeply equal { label: 'Mental', value: +0, …(1) }

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:320:22
  */
 export class EterFeverDecorator extends StatusEffectDecorator {
 	public override get mental(): number {
-		return Math.max(0, this.wrapped.mental - 1);
+		return Math.max(0, this.wrapped.mental + 1);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Febre de Éter (EterFeverDecorator) reduzindo mental e resistance e recalculando maxHp
statusReason: expected 3 to be 1 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:320:10
  */
 export class EterFeverDecorator extends StatusEffectDecorator {
 	public override get mental(): number {
-		return Math.max(0, this.wrapped.mental - 1);
+		return Math.min(0, this.wrapped.mental - 1);
 	}
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:323:43
 		return Math.max(0, this.wrapped.mental - 1);
 	}
 
-	public override get resistance(): number {
-		return Math.max(0, this.wrapped.resistance - 1);
-	}
+	public override get resistance(): number {}
 }
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected undefined to be 2 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:324:10
 	}
 
 	public override get resistance(): number {
-		return Math.max(0, this.wrapped.resistance - 1);
+		return Math.min(0, this.wrapped.resistance - 1);
 	}
 }
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:324:22
 	}
 
 	public override get resistance(): number {
-		return Math.max(0, this.wrapped.resistance - 1);
+		return Math.max(0, this.wrapped.resistance + 1);
 	}
 }
killedBy: createCharacterListView applies status effect decorators (Eter Fever) and recalculates stats dynamically
statusReason: expected { Object (label, value, ...) } to deeply equal { Object (label, value, ...) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:334:41
  * Reduz: physical -1, impede cura natural no acampamento.
  */
 export class WoundInfectionDecorator extends StatusEffectDecorator {
-	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
-	}
+	public override get physical(): number {}
 
 	// Impede a cura natural
killedBy: createCharacterListView applies multiple decorators (Wound Infection + Eter Fever) in onion pattern
statusReason: expected { label: 'Físico', …(2) } to deeply equal { label: 'Físico', value: 2, …(1) }

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:335:10
  */
 export class WoundInfectionDecorator extends StatusEffectDecorator {
 	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
+		return Math.min(0, this.wrapped.physical - 1);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Infecção de Ferida (WoundInfectionDecorator) reduzindo physical e impedindo cura natural
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:335:22
  */
 export class WoundInfectionDecorator extends StatusEffectDecorator {
 	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
+		return Math.max(0, this.wrapped.physical + 1);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Infecção de Ferida (WoundInfectionDecorator) reduzindo physical e impedindo cura natural
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:339:55
 	}
 
 	// Impede a cura natural
-	public override get allowsNaturalRecovery(): boolean {
-		return false;
-	}
+	public override get allowsNaturalRecovery(): boolean {}
 }
 
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:340:10
 
 	// Impede a cura natural
 	public override get allowsNaturalRecovery(): boolean {
-		return false;
+		return true;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Infecção de Ferida (WoundInfectionDecorator) reduzindo physical e impedindo cura natural
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:350:41
  * Reduz: physical -2, iniciativa -1.
  */
 export class ViperPoisonDecorator extends StatusEffectDecorator {
-	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 2);
-	}
+	public override get physical(): number {}
 
 	// Reduz a iniciativa base final em 1
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected undefined to be +0 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:351:10
  */
 export class ViperPoisonDecorator extends StatusEffectDecorator {
 	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 2);
+		return Math.min(0, this.wrapped.physical - 2);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Veneno de Víbora (ViperPoisonDecorator) reduzindo physical em 2 e initiative em 1
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:351:22
  */
 export class ViperPoisonDecorator extends StatusEffectDecorator {
 	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 2);
+		return Math.max(0, this.wrapped.physical + 2);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Veneno de Víbora (ViperPoisonDecorator) reduzindo physical em 2 e initiative em 1
statusReason: expected 6 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:355:47
 	}
 
 	// Reduz a iniciativa base final em 1
-	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 1);
-	}
+	public override get initiativeBase(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Veneno de Víbora (ViperPoisonDecorator) reduzindo physical em 2 e initiative em 1
statusReason: expected undefined to be 2 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:356:10
 
 	// Reduz a iniciativa base final em 1
 	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 1);
+		return Math.min(0, super.initiativeBase - 1);
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Veneno de Víbora (ViperPoisonDecorator) reduzindo physical em 2 e initiative em 1
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:356:22
 
 	// Reduz a iniciativa base final em 1
 	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 1);
+		return Math.max(0, super.initiativeBase + 1);
 	}
 }
killedBy: IllnessService - Integração e Testes de Patologias deve aplicar a cebola de Decoradores reativamente baseando-se nos efeitos ativos
statusReason: expected 5 to be 3 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:372:51
 		super(wrapped);
 	}
 
-	public override get currentCarryWeight(): number {
-		return this.equippedWeight;
-	}
+	public override get currentCarryWeight(): number {}
 
 	public override get encumbranceState():
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected undefined to be 5 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:379:18
 	public override get encumbranceState():
 		| "light"
 		| "encumbered"
-		| "overloaded" {
-		const limit = this.carrySlotLimit;
-		if (this.equippedWeight > limit + 5) {
-			return "overloaded";
-		}
-		if (this.equippedWeight > limit) {
-			return "encumbered";
-		}
-		return "light";
-	}
+		| "overloaded" {}
 
 	public override get movementSpeedBase(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected undefined to be 'light' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:381:7
 		| "encumbered"
 		| "overloaded" {
 		const limit = this.carrySlotLimit;
-		if (this.equippedWeight > limit + 5) {
+		if (false) {
 			return "overloaded";
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Imobilizado (overloaded) se o peso exceder o limite + 5, reduz
statusReason: expected 'encumbered' to be 'overloaded' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:381:7
 		| "encumbered"
 		| "overloaded" {
 		const limit = this.carrySlotLimit;
-		if (this.equippedWeight > limit + 5) {
+		if (true) {
 			return "overloaded";
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected 'overloaded' to be 'light' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:384:7
 		if (this.equippedWeight > limit + 5) {
 			return "overloaded";
 		}
-		if (this.equippedWeight > limit) {
+		if (true) {
 			return "encumbered";
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected 'encumbered' to be 'light' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:384:7
 		if (this.equippedWeight > limit + 5) {
 			return "overloaded";
 		}
-		if (this.equippedWeight > limit) {
+		if (false) {
 			return "encumbered";
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 'light' to be 'encumbered' // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:390:50
 		return "light";
 	}
 
-	public override get movementSpeedBase(): number {
-		const state = this.encumbranceState;
-		if (state === "overloaded") {
-			return 0; // Imobilizado (Velocidade 0)
-		}
-		if (state === "encumbered") {
-			// Lento (-3m na velocidade)
-			return Math.max(1, this.wrapped.movementSpeedBase - 3);
-		}
-		return this.wrapped.movementSpeedBase;
-	}
+	public override get movementSpeedBase(): number {}
 
 	public override get initiativeBase(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected undefined to be 9 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:392:7
 
 	public override get movementSpeedBase(): number {
 		const state = this.encumbranceState;
-		if (state === "overloaded") {
+		if (true) {
 			return 0; // Imobilizado (Velocidade 0)
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected +0 to be 9 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/StatusEffectDecorator.ts:392:7
 
 	public override get movementSpeedBase(): number {
 		const state = this.encumbranceState;
-		if (state === "overloaded") {
+		if (state !== "overloaded") {
 			return 0; // Imobilizado (Velocidade 0)
 		}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected +0 to be 9 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:395:7
 		if (state === "overloaded") {
 			return 0; // Imobilizado (Velocidade 0)
 		}
-		if (state === "encumbered") {
+		if (false) {
 			// Lento (-3m na velocidade)
 			return Math.max(1, this.wrapped.movementSpeedBase - 3);
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 9 to be 6 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:395:31
 		if (state === "overloaded") {
 			return 0; // Imobilizado (Velocidade 0)
 		}
-		if (state === "encumbered") {
-			// Lento (-3m na velocidade)
-			return Math.max(1, this.wrapped.movementSpeedBase - 3);
-		}
+		if (state === "encumbered") {}
 		return this.wrapped.movementSpeedBase;
 	}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 9 to be 6 // Object.is equality
