[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:397:11
 		}
 		if (state === "encumbered") {
 			// Lento (-3m na velocidade)
-			return Math.max(1, this.wrapped.movementSpeedBase - 3);
+			return Math.min(1, this.wrapped.movementSpeedBase - 3);
 		}
 		return this.wrapped.movementSpeedBase;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 1 to be 6 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:397:23
 		}
 		if (state === "encumbered") {
 			// Lento (-3m na velocidade)
-			return Math.max(1, this.wrapped.movementSpeedBase - 3);
+			return Math.max(1, this.wrapped.movementSpeedBase + 3);
 		}
 		return this.wrapped.movementSpeedBase;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 12 to be 6 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:402:47
 		return this.wrapped.movementSpeedBase;
 	}
 
-	public override get initiativeBase(): number {
-		const state = this.encumbranceState;
-		if (state === "encumbered" || state === "overloaded") {
-			// -2 na Iniciativa por estar sobrecarregado
-			return Math.max(0, this.wrapped.initiativeBase - 2);
-		}
-		return this.wrapped.initiativeBase;
-	}
+	public override get initiativeBase(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado de Carga Leve se o peso não exceder o limite
statusReason: expected undefined to be 3 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/StatusEffectDecorator.ts:404:7
 
 	public override get initiativeBase(): number {
 		const state = this.encumbranceState;
-		if (state === "encumbered" || state === "overloaded") {
+		if (state === "encumbered" && state === "overloaded") {
 			// -2 na Iniciativa por estar sobrecarregado
 			return Math.max(0, this.wrapped.initiativeBase - 2);
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:404:57
 
 	public override get initiativeBase(): number {
 		const state = this.encumbranceState;
-		if (state === "encumbered" || state === "overloaded") {
-			// -2 na Iniciativa por estar sobrecarregado
-			return Math.max(0, this.wrapped.initiativeBase - 2);
-		}
+		if (state === "encumbered" || state === "overloaded") {}
 		return this.wrapped.initiativeBase;
 	}
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 3 to be 1 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:406:11
 		const state = this.encumbranceState;
 		if (state === "encumbered" || state === "overloaded") {
 			// -2 na Iniciativa por estar sobrecarregado
-			return Math.max(0, this.wrapped.initiativeBase - 2);
+			return Math.min(0, this.wrapped.initiativeBase - 2);
 		}
 		return this.wrapped.initiativeBase;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:406:23
 		const state = this.encumbranceState;
 		if (state === "encumbered" || state === "overloaded") {
 			// -2 na Iniciativa por estar sobrecarregado
-			return Math.max(0, this.wrapped.initiativeBase - 2);
+			return Math.max(0, this.wrapped.initiativeBase + 2);
 		}
 		return this.wrapped.initiativeBase;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Logística de Carga e Sobrecarga (EncumberedStatusDecorator) deve aplicar estado Sobrecarregado (encumbered) se o peso exceder o limite, reduzi
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:418:41
  * Reduz: physical -1, mental -1, impede cura natural.
  */
 export class HungryDecorator extends StatusEffectDecorator {
-	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
-	}
+	public override get physical(): number {}
 
 	public override get mental(): number {
killedBy: createCharacterListView applies Viper Poison and Hungry decorators, handles unknown effects, and fallback classes
statusReason: expected { label: 'Físico', …(2) } to deeply equal { label: 'Físico', value: +0, …(1) }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:422:39
 		return Math.max(0, this.wrapped.physical - 1);
 	}
 
-	public override get mental(): number {
-		return Math.max(0, this.wrapped.mental - 1);
-	}
+	public override get mental(): number {}
 
 	public override get allowsNaturalRecovery(): boolean {
killedBy: createCharacterListView applies Viper Poison and Hungry decorators, handles unknown effects, and fallback classes
statusReason: expected { label: 'Mental', …(2) } to deeply equal { label: 'Mental', value: +0, …(1) }

[Survived] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:426:55
 		return Math.max(0, this.wrapped.mental - 1);
 	}
 
-	public override get allowsNaturalRecovery(): boolean {
-		return false;
-	}
+	public override get allowsNaturalRecovery(): boolean {}
 }
 

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:437:41
  * Reduz: physical -1, mental -1, social -1.
  */
 export class ExhaustedDecorator extends StatusEffectDecorator {
-	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
-	}
+	public override get physical(): number {}
 
 	public override get mental(): number {

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:445:39
 		return Math.max(0, this.wrapped.mental - 1);
 	}
 
-	public override get social(): number {
-		return Math.max(0, this.wrapped.social - 1);
-	}
+	public override get social(): number {}
 }
 

[NoCoverage] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:446:22
 	}
 
 	public override get social(): number {
-		return Math.max(0, this.wrapped.social - 1);
+		return Math.max(0, this.wrapped.social + 1);
 	}
 }

[NoCoverage] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:446:10
 	}
 
 	public override get social(): number {
-		return Math.max(0, this.wrapped.social - 1);
+		return Math.min(0, this.wrapped.social - 1);
 	}
 }

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:456:41
  * Reduz: physical -1, impede cura natural.
  */
 export class BleedingDecorator extends StatusEffectDecorator {
-	public override get physical(): number {
-		return Math.max(0, this.wrapped.physical - 1);
-	}
+	public override get physical(): number {}
 
 	public override get allowsNaturalRecovery(): boolean {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Sangramento (BleedingDecorator) reduzindo physical e impedindo cura natural
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:471:39
  * Reduz: mental -1, interaction -1.
  */
 export class SilencedDecorator extends StatusEffectDecorator {
-	public override get mental(): number {
-		return Math.max(0, this.wrapped.mental - 1);
-	}
+	public override get mental(): number {}
 
 	public override get interaction(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Silenciado (SilencedDecorator) reduzindo mental e interaction
statusReason: expected undefined to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:475:44
 		return Math.max(0, this.wrapped.mental - 1);
 	}
 
-	public override get interaction(): number {
-		return Math.max(0, this.wrapped.interaction - 1);
-	}
+	public override get interaction(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Silenciado (SilencedDecorator) reduzindo mental e interaction
statusReason: expected undefined to be 2 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:476:10
 	}
 
 	public override get interaction(): number {
-		return Math.max(0, this.wrapped.interaction - 1);
+		return Math.min(0, this.wrapped.interaction - 1);
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Silenciado (SilencedDecorator) reduzindo mental e interaction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:476:22
 	}
 
 	public override get interaction(): number {
-		return Math.max(0, this.wrapped.interaction - 1);
+		return Math.max(0, this.wrapped.interaction + 1);
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Silenciado (SilencedDecorator) reduzindo mental e interaction
statusReason: expected 4 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:486:50
  * Reduz: movementSpeedBase para 0, conflict -2, e initiativeBase -2.
  */
 export class ImmobilizedDecorator extends StatusEffectDecorator {
-	public override get movementSpeedBase(): number {
-		return 0;
-	}
+	public override get movementSpeedBase(): number {}
 
 	public override get conflict(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:490:41
 		return 0;
 	}
 
-	public override get conflict(): number {
-		return Math.max(0, this.wrapped.conflict - 2);
-	}
+	public override get conflict(): number {}
 
 	public override get initiativeBase(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:491:10
 	}
 
 	public override get conflict(): number {
-		return Math.max(0, this.wrapped.conflict - 2);
+		return Math.min(0, this.wrapped.conflict - 2);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:491:22
 	}
 
 	public override get conflict(): number {
-		return Math.max(0, this.wrapped.conflict - 2);
+		return Math.max(0, this.wrapped.conflict + 2);
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:494:47
 		return Math.max(0, this.wrapped.conflict - 2);
 	}
 
-	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 2);
-	}
+	public override get initiativeBase(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected undefined to be 5 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:495:10
 	}
 
 	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 2);
+		return Math.min(0, super.initiativeBase - 2);
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:495:22
 	}
 
 	public override get initiativeBase(): number {
-		return Math.max(0, super.initiativeBase - 2);
+		return Math.max(0, super.initiativeBase + 2);
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha deve aplicar Imobilizado (ImmobilizedDecorator) reduzindo movementSpeedBase para 0, conflict e initiative
statusReason: expected 9 to be 5 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:505:45
  * Reduz: extraActions e velocidade para 0, e força falha automática em testes de defesa.
  */
 export class UnconsciousDecorator extends StatusEffectDecorator {
-	public override get extraActions(): number {
-		return 0;
-	}
+	public override get extraActions(): number {}
 
 	public override get movementSpeedBase(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Efeitos de Condições de Inconsciência e 0 HP deve aplicar UnconsciousDecorator reduzindo ações e velocidade a zero, e ativando falha automátic
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:509:50
 		return 0;
 	}
 
-	public override get movementSpeedBase(): number {
-		return 0;
-	}
+	public override get movementSpeedBase(): number {}
 
 	public override get automaticDefenseFailure(): boolean {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Efeitos de Condições de Inconsciência e 0 HP deve aplicar UnconsciousDecorator reduzindo ações e velocidade a zero, e ativando falha automátic
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:513:57
 		return 0;
 	}
 
-	public override get automaticDefenseFailure(): boolean {
-		return true;
-	}
+	public override get automaticDefenseFailure(): boolean {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Efeitos de Condições de Inconsciência e 0 HP deve aplicar UnconsciousDecorator reduzindo ações e velocidade a zero, e ativando falha automátic
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:514:10
 	}
 
 	public override get automaticDefenseFailure(): boolean {
-		return true;
+		return false;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Efeitos de Condições de Inconsciência e 0 HP deve aplicar UnconsciousDecorator reduzindo ações e velocidade a zero, e ativando falha automátic
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:530:49
  * Ultimate de Vanguarda: Aumenta o tamanho, concede HP temporário (+20) e adiciona +2 no dano com armas.
  */
 export class AvatarGuerraDecorator extends StatusEffectDecorator {
-	public override get size(): "medium" | "large" {
-		return "large";
-	}
+	public override get size(): "medium" | "large" {}
 
 	public override get maxHp(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected undefined to be 'large' // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:534:38
 		return "large";
 	}
 
-	public override get maxHp(): number {
-		return this.wrapped.maxHp + 20;
-	}
+	public override get maxHp(): number {}
 
 	public override get weaponDamageBonus(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected undefined to be 36 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:535:10
 	}
 
 	public override get maxHp(): number {
-		return this.wrapped.maxHp + 20;
+		return this.wrapped.maxHp - 20;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected -4 to be 36 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:538:50
 		return this.wrapped.maxHp + 20;
 	}
 
-	public override get weaponDamageBonus(): number {
-		return this.wrapped.weaponDamageBonus + 2;
-	}
+	public override get weaponDamageBonus(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:539:10
 	}
 
 	public override get weaponDamageBonus(): number {
-		return this.wrapped.weaponDamageBonus + 2;
+		return this.wrapped.weaponDamageBonus - 2;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar AvatarGuerraDecorator com aumento de tamanho, HP máximo e dano com armas
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:548:45
  * Ultimate de Tecelão: +1 ação extra por turno, +2 em Resistência Física (eixo physical).
  */
 export class SurtoTempoDecorator extends StatusEffectDecorator {
-	public override get extraActions(): number {
-		return this.wrapped.extraActions + 1;
-	}
+	public override get extraActions(): number {}
 
 	public override get physical(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar SurtoTempoDecorator com aumento de ações e bônus no eixo físico
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:549:10
  */
 export class SurtoTempoDecorator extends StatusEffectDecorator {
 	public override get extraActions(): number {
-		return this.wrapped.extraActions + 1;
+		return this.wrapped.extraActions - 1;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar SurtoTempoDecorator com aumento de ações e bônus no eixo físico
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:552:41
 		return this.wrapped.extraActions + 1;
 	}
 
-	public override get physical(): number {
-		return this.wrapped.physical + 2;
-	}
+	public override get physical(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar SurtoTempoDecorator com aumento de ações e bônus no eixo físico
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:553:10
 	}
 
 	public override get physical(): number {
-		return this.wrapped.physical + 2;
+		return this.wrapped.physical - 2;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar SurtoTempoDecorator com aumento de ações e bônus no eixo físico
statusReason: expected 1 to be 5 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:562:44
  * Ultimate de Caçador: +5 de bônus no ataque, ignora terreno difícil.
  */
 export class CacadaSelvagemDecorator extends StatusEffectDecorator {
-	public override get attackBonus(): number {
-		return this.wrapped.attackBonus + 5;
-	}
+	public override get attackBonus(): number {}
 
 	public override get ignoresDifficultTerrain(): boolean {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar CacadaSelvagemDecorator com bônus de ataque e imunidade a terreno difícil
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:563:10
  */
 export class CacadaSelvagemDecorator extends StatusEffectDecorator {
 	public override get attackBonus(): number {
-		return this.wrapped.attackBonus + 5;
+		return this.wrapped.attackBonus - 5;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar CacadaSelvagemDecorator com bônus de ataque e imunidade a terreno difícil
statusReason: expected -5 to be 5 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:566:57
 		return this.wrapped.attackBonus + 5;
 	}
 
-	public override get ignoresDifficultTerrain(): boolean {
-		return true;
-	}
+	public override get ignoresDifficultTerrain(): boolean {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar CacadaSelvagemDecorator com bônus de ataque e imunidade a terreno difícil
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:567:10
 	}
 
 	public override get ignoresDifficultTerrain(): boolean {
-		return true;
+		return false;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Decoradores de Ultimates deve aplicar CacadaSelvagemDecorator com bônus de ataque e imunidade a terreno difícil
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:591:58
 		super(wrapped);
 	}
 
-	public override get hasLatentDiscoordination(): boolean {
-		return true;
-	}
+	public override get hasLatentDiscoordination(): boolean {}
 
 	public override get latentDiscoordinationAxis(): string | null {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Descoordenação Latente (LatentDiscoordinationDecorator) deve propagar a flag hasLatentDiscoordination e dados do eixo/testes
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/StatusEffectDecorator.ts:592:10
 	}
 
 	public override get hasLatentDiscoordination(): boolean {
-		return true;
+		return false;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Descoordenação Latente (LatentDiscoordinationDecorator) deve propagar a flag hasLatentDiscoordination e dados do eixo/testes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:595:65
 		return true;
 	}
 
-	public override get latentDiscoordinationAxis(): string | null {
-		return this.axis;
-	}
+	public override get latentDiscoordinationAxis(): string | null {}
 
 	public override get latentDiscoordinationTestsLeft(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Descoordenação Latente (LatentDiscoordinationDecorator) deve propagar a flag hasLatentDiscoordination e dados do eixo/testes
statusReason: expected undefined to be 'mental' // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:599:63
 		return this.axis;
 	}
 
-	public override get latentDiscoordinationTestsLeft(): number {
-		return this.tests;
-	}
+	public override get latentDiscoordinationTestsLeft(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Descoordenação Latente (LatentDiscoordinationDecorator) deve propagar a flag hasLatentDiscoordination e dados do eixo/testes
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:609:43
  * Talento Tático de Vanguarda: Concede +2 de Resistência (eixo resistance) e +1 de Físico (eixo physical).
  */
 export class ExtraBreathDecorator extends StatusEffectDecorator {
-	public override get resistance(): number {
-		return this.wrapped.resistance + 2;
-	}
+	public override get resistance(): number {}
 
 	public override get physical(): number {
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Talentos Táticos de Classe (ExtraBreathDecorator & DoubleTimeDecorator) deve aplicar ExtraBreathDecorator (+2 Resistência, +1 Físico) e recalc
statusReason: expected undefined to be 5 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:610:10
  */
 export class ExtraBreathDecorator extends StatusEffectDecorator {
 	public override get resistance(): number {
-		return this.wrapped.resistance + 2;
+		return this.wrapped.resistance - 2;
 	}
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Talentos Táticos de Classe (ExtraBreathDecorator & DoubleTimeDecorator) deve aplicar ExtraBreathDecorator (+2 Resistência, +1 Físico) e recalc
statusReason: expected 1 to be 5 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:613:41
 		return this.wrapped.resistance + 2;
 	}
 
-	public override get physical(): number {
-		return this.wrapped.physical + 1;
-	}
+	public override get physical(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Talentos Táticos de Classe (ExtraBreathDecorator & DoubleTimeDecorator) deve aplicar ExtraBreathDecorator (+2 Resistência, +1 Físico) e recalc
statusReason: expected undefined to be 4 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:614:10
 	}
 
 	public override get physical(): number {
-		return this.wrapped.physical + 1;
+		return this.wrapped.physical - 1;
 	}
 }
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Talentos Táticos de Classe (ExtraBreathDecorator & DoubleTimeDecorator) deve aplicar ExtraBreathDecorator (+2 Resistência, +1 Físico) e recalc
statusReason: expected 2 to be 4 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:623:45
  * Talento Tático de Tecelão: Concede +1 Ação Adicional (extraActions).
  */
 export class DoubleTimeDecorator extends StatusEffectDecorator {
-	public override get extraActions(): number {
-		return this.wrapped.extraActions + 1;
-	}
+	public override get extraActions(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha Talentos Táticos de Classe (ExtraBreathDecorator & DoubleTimeDecorator) deve aplicar DoubleTimeDecorator (+1 ação extra)
statusReason: expected undefined to be 1 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:653:38
  * Corta HP e EE máximo pela metade e reduz o deslocamento tático a 50%.
  */
 export class CellularCollapseDecorator extends StatusEffectDecorator {
-	public override get maxHp(): number {
-		return Math.floor(super.maxHp * 0.5);
-	}
+	public override get maxHp(): number {}
 
 	public override get maxEe(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:654:21
  */
 export class CellularCollapseDecorator extends StatusEffectDecorator {
 	public override get maxHp(): number {
-		return Math.floor(super.maxHp * 0.5);
+		return Math.floor(super.maxHp / 0.5);
 	}
 
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 34 to be 8 // Object.is equality

[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:657:38
 		return Math.floor(super.maxHp * 0.5);
 	}
 
-	public override get maxEe(): number {
-		return Math.floor(super.maxEe * 0.5);
-	}
+	public override get maxEe(): number {}
 
 	public override get movementSpeedBase(): number {
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:658:21
 	}
 
 	public override get maxEe(): number {
-		return Math.floor(super.maxEe * 0.5);
+		return Math.floor(super.maxEe / 0.5);
 	}
 
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 8 to be 2 // Object.is equality
