[Killed] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:661:50
 		return Math.floor(super.maxEe * 0.5);
 	}
 
-	public override get movementSpeedBase(): number {
-		return Math.max(1, Math.floor(super.movementSpeedBase * 0.5));
-	}
+	public override get movementSpeedBase(): number {}
 }
 
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected undefined to be 4 // Object.is equality

[Killed] MethodExpression
entities/character/domain/StatusEffectDecorator.ts:662:10
 	}
 
 	public override get movementSpeedBase(): number {
-		return Math.max(1, Math.floor(super.movementSpeedBase * 0.5));
+		return Math.min(1, Math.floor(super.movementSpeedBase * 0.5));
 	}
 }
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 1 to be 4 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/StatusEffectDecorator.ts:662:33
 	}
 
 	public override get movementSpeedBase(): number {
-		return Math.max(1, Math.floor(super.movementSpeedBase * 0.5));
+		return Math.max(1, Math.floor(super.movementSpeedBase / 0.5));
 	}
 }
killedBy: Cascata de Exaustão - Integração e Decoradores deve aplicar individualmente os decoradores concretos de exaustão
statusReason: expected 18 to be 4 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:680:4
 	let decorated = baseStats;
 	for (const effect of effects) {
 		switch (effect.type) {
-			case "eter_fever":
-				decorated = new EterFeverDecorator(decorated);
-				break;
+			case "eter_fever":
 			case "wound_infection":
 				decorated = new WoundInfectionDecorator(decorated);
killedBy: createCharacterListView applies status effect decorators (Eter Fever) and recalculates stats dynamically
statusReason: expected { label: 'Mental', value: 1 } to deeply equal { label: 'Mental', value: +0, …(1) }

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:683:4
 			case "eter_fever":
 				decorated = new EterFeverDecorator(decorated);
 				break;
-			case "wound_infection":
-				decorated = new WoundInfectionDecorator(decorated);
-				break;
+			case "wound_infection":
 			case "viper_poison":
 				decorated = new ViperPoisonDecorator(decorated);
killedBy: createCharacterListView applies multiple decorators (Wound Infection + Eter Fever) in onion pattern
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:686:4
 			case "wound_infection":
 				decorated = new WoundInfectionDecorator(decorated);
 				break;
-			case "viper_poison":
-				decorated = new ViperPoisonDecorator(decorated);
-				break;
+			case "viper_poison":
 			case "hungry":
 				decorated = new HungryDecorator(decorated);
killedBy: createCharacterListView applies Viper Poison and Hungry decorators, handles unknown effects, and fallback classes
statusReason: expected { label: 'Físico', value: 1, …(1) } to deeply equal { label: 'Físico', value: +0, …(1) }

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:689:4
 			case "viper_poison":
 				decorated = new ViperPoisonDecorator(decorated);
 				break;
-			case "hungry":
-				decorated = new HungryDecorator(decorated);
-				break;
+			case "hungry":
 			case "exhausted":
 				decorated = new ExhaustedDecorator(decorated);
killedBy: createCharacterListView applies Viper Poison and Hungry decorators, handles unknown effects, and fallback classes
statusReason: expected { label: 'Social', value: 1, …(1) } to deeply equal { label: 'Social', value: 2 }

[Killed] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:689:9
 			case "viper_poison":
 				decorated = new ViperPoisonDecorator(decorated);
 				break;
-			case "hungry":
+			case "":
 				decorated = new HungryDecorator(decorated);
 				break;
killedBy: createCharacterListView applies Viper Poison and Hungry decorators, handles unknown effects, and fallback classes
statusReason: expected { label: 'Físico', value: 1, …(1) } to deeply equal { label: 'Físico', value: +0, …(1) }

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:692:4
 			case "hungry":
 				decorated = new HungryDecorator(decorated);
 				break;
-			case "exhausted":
-				decorated = new ExhaustedDecorator(decorated);
-				break;
+			case "exhausted":
 			case "bleeding":
 				decorated = new BleedingDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:695:4
 			case "exhausted":
 				decorated = new ExhaustedDecorator(decorated);
 				break;
-			case "bleeding":
-				decorated = new BleedingDecorator(decorated);
-				break;
+			case "bleeding":
 			case "silenced":
 				decorated = new SilencedDecorator(decorated);

[Survived] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:695:9
 			case "exhausted":
 				decorated = new ExhaustedDecorator(decorated);
 				break;
-			case "bleeding":
+			case "":
 				decorated = new BleedingDecorator(decorated);
 				break;

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:698:4
 			case "bleeding":
 				decorated = new BleedingDecorator(decorated);
 				break;
-			case "silenced":
-				decorated = new SilencedDecorator(decorated);
-				break;
+			case "silenced":
 			case "immobilized":
 				decorated = new ImmobilizedDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:701:4
 			case "silenced":
 				decorated = new SilencedDecorator(decorated);
 				break;
-			case "immobilized":
-				decorated = new ImmobilizedDecorator(decorated);
-				break;
+			case "immobilized":
 			case "unconscious":
 				decorated = new UnconsciousDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:704:4
 			case "immobilized":
 				decorated = new ImmobilizedDecorator(decorated);
 				break;
-			case "unconscious":
-				decorated = new UnconsciousDecorator(decorated);
-				break;
+			case "unconscious":
 			case "moribund":
 				decorated = new MoribundDecorator(decorated);

[Survived] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:704:9
 			case "immobilized":
 				decorated = new ImmobilizedDecorator(decorated);
 				break;
-			case "unconscious":
+			case "":
 				decorated = new UnconsciousDecorator(decorated);
 				break;

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:707:4
 			case "unconscious":
 				decorated = new UnconsciousDecorator(decorated);
 				break;
-			case "moribund":
-				decorated = new MoribundDecorator(decorated);
-				break;
+			case "moribund":
 			case "avatar_guerra":
 				decorated = new AvatarGuerraDecorator(decorated);

[Survived] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:707:9
 			case "unconscious":
 				decorated = new UnconsciousDecorator(decorated);
 				break;
-			case "moribund":
+			case "":
 				decorated = new MoribundDecorator(decorated);
 				break;

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:710:4
 			case "moribund":
 				decorated = new MoribundDecorator(decorated);
 				break;
-			case "avatar_guerra":
-				decorated = new AvatarGuerraDecorator(decorated);
-				break;
+			case "avatar_guerra":
 			case "surto_tempo":
 				decorated = new SurtoTempoDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:713:4
 			case "avatar_guerra":
 				decorated = new AvatarGuerraDecorator(decorated);
 				break;
-			case "surto_tempo":
-				decorated = new SurtoTempoDecorator(decorated);
-				break;
+			case "surto_tempo":
 			case "cacada_selvagem":
 				decorated = new CacadaSelvagemDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:716:4
 			case "surto_tempo":
 				decorated = new SurtoTempoDecorator(decorated);
 				break;
-			case "cacada_selvagem":
-				decorated = new CacadaSelvagemDecorator(decorated);
-				break;
+			case "cacada_selvagem":
 			case "rede_intrigas":
 				decorated = new RedeIntrigasDecorator(decorated);

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:719:4
 			case "cacada_selvagem":
 				decorated = new CacadaSelvagemDecorator(decorated);
 				break;
-			case "rede_intrigas":
-				decorated = new RedeIntrigasDecorator(decorated);
-				break;
+			case "rede_intrigas":
 			case "extra_breath":
 				decorated = new ExtraBreathDecorator(decorated);

[Survived] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:722:4
 			case "rede_intrigas":
 				decorated = new RedeIntrigasDecorator(decorated);
 				break;
-			case "extra_breath":
-				decorated = new ExtraBreathDecorator(decorated);
-				break;
+			case "extra_breath":
 			case "double_time":
 				decorated = new DoubleTimeDecorator(decorated);

[Survived] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:725:4
 			case "extra_breath":
 				decorated = new ExtraBreathDecorator(decorated);
 				break;
-			case "double_time":
-				decorated = new DoubleTimeDecorator(decorated);
-				break;
+			case "double_time":
 			case "body_fatigue":
 				decorated = new BodyFatigueDecorator(decorated);

[Survived] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:728:4
 			case "double_time":
 				decorated = new DoubleTimeDecorator(decorated);
 				break;
-			case "body_fatigue":
-				decorated = new BodyFatigueDecorator(decorated);
-				break;
+			case "body_fatigue":
 			case "mental_fog":
 				decorated = new MentalFogDecorator(decorated);

[Survived] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:731:4
 			case "body_fatigue":
 				decorated = new BodyFatigueDecorator(decorated);
 				break;
-			case "mental_fog":
-				decorated = new MentalFogDecorator(decorated);
-				break;
+			case "mental_fog":
 			case "spirit_ruin":
 				decorated = new SpiritRuinDecorator(decorated);

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:734:4
 			case "mental_fog":
 				decorated = new MentalFogDecorator(decorated);
 				break;
-			case "spirit_ruin":
-				decorated = new SpiritRuinDecorator(decorated);
-				break;
+			case "spirit_ruin":
 			case "cellular_collapse":
 				decorated = new CellularCollapseDecorator(decorated);
killedBy: Cascata de Exaustão - Integração e Decoradores deve empilhar os efeitos através do applyStatusEffects
statusReason: expected 4 to be 8 // Object.is equality

[Survived] StringLiteral
entities/character/domain/StatusEffectDecorator.ts:734:9
 			case "mental_fog":
 				decorated = new MentalFogDecorator(decorated);
 				break;
-			case "spirit_ruin":
+			case "":
 				decorated = new SpiritRuinDecorator(decorated);
 				break;

[Killed] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:737:4
 			case "spirit_ruin":
 				decorated = new SpiritRuinDecorator(decorated);
 				break;
-			case "cellular_collapse":
-				decorated = new CellularCollapseDecorator(decorated);
-				break;
+			case "cellular_collapse":
 			case "latent_discoordination": {
 				const axis = effect.metadata || "physical";
killedBy: Cascata de Exaustão - Integração e Decoradores deve empilhar os efeitos através do applyStatusEffects
statusReason: expected 17 to be 8 // Object.is equality

[NoCoverage] BlockStatement
entities/character/domain/StatusEffectDecorator.ts:740:35
 			case "cellular_collapse":
 				decorated = new CellularCollapseDecorator(decorated);
 				break;
-			case "latent_discoordination": {
-				const axis = effect.metadata || "physical";
-				const severity = effect.severity ?? 3;
-				decorated = new LatentDiscoordinationDecorator(
-					decorated,
-					axis,
-					severity,
-				);
-				break;
-			}
+			case "latent_discoordination": {}
 		}
 	}

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:740:4
 			case "cellular_collapse":
 				decorated = new CellularCollapseDecorator(decorated);
 				break;
-			case "latent_discoordination": {
-				const axis = effect.metadata || "physical";
-				const severity = effect.severity ?? 3;
-				decorated = new LatentDiscoordinationDecorator(
-					decorated,
-					axis,
-					severity,
-				);
-				break;
-			}
+			case "latent_discoordination":
 		}
 	}

[NoCoverage] ConditionalExpression
entities/character/domain/StatusEffectDecorator.ts:741:18
 				decorated = new CellularCollapseDecorator(decorated);
 				break;
 			case "latent_discoordination": {
-				const axis = effect.metadata || "physical";
+				const axis = false;
 				const severity = effect.severity ?? 3;
 				decorated = new LatentDiscoordinationDecorator(

[NoCoverage] LogicalOperator
entities/character/domain/StatusEffectDecorator.ts:741:18
 				decorated = new CellularCollapseDecorator(decorated);
 				break;
 			case "latent_discoordination": {
-				const axis = effect.metadata || "physical";
+				const axis = effect.metadata && "physical";
 				const severity = effect.severity ?? 3;
 				decorated = new LatentDiscoordinationDecorator(

[NoCoverage] LogicalOperator
entities/character/domain/StatusEffectDecorator.ts:742:22
 				break;
 			case "latent_discoordination": {
 				const axis = effect.metadata || "physical";
-				const severity = effect.severity ?? 3;
+				const severity = effect.severity && 3;
 				decorated = new LatentDiscoordinationDecorator(
 					decorated,
