[Killed] BlockStatement
entities/character/domain/ArmorStatsDecorator.ts:29:43
 		super(wrapped);
 	}
 
-	public override get armorClass(): number {
-		const limitedPhysical = this.setup.isHeavy ? 0 : this.wrapped.physical;
-		return (
-			10 +
-			this.wrapped.level +
-			this.setup.armorBonus +
-			limitedPhysical +
-			this.setup.shieldBonus
-		);
-	}
+	public override get armorClass(): number {}
 
 	public override get movementSpeedBase(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/ArmorStatsDecorator.ts:32:4
 	public override get armorClass(): number {
 		const limitedPhysical = this.setup.isHeavy ? 0 : this.wrapped.physical;
 		return (
-			10 +
-			this.wrapped.level +
-			this.setup.armorBonus +
-			limitedPhysical +
-			this.setup.shieldBonus
+			10 + this.wrapped.level + this.setup.armorBonus + limitedPhysical - this.setup.shieldBonus
 		);
 	}
killedBy: createCombatAttackerStatsView shows derived stats with equipped heavy armor (+5 CA, 0 physical bonus, -3m speed)
statusReason: expected 'CA: 15' to be 'CA: 17' // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/ArmorStatsDecorator.ts:32:4
 	public override get armorClass(): number {
 		const limitedPhysical = this.setup.isHeavy ? 0 : this.wrapped.physical;
 		return (
-			10 +
-			this.wrapped.level +
+			10 - this.wrapped.level +
 			this.setup.armorBonus +
 			limitedPhysical +
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/ArmorStatsDecorator.ts:40:50
 		);
 	}
 
-	public override get movementSpeedBase(): number {
-		const baseSpeed = this.wrapped.movementSpeedBase;
-		if (this.setup.isHeavy) {
-			// Reduz em 3m a velocidade base do personagem
-			return Math.max(0, baseSpeed - 3);
-		}
-		return baseSpeed;
-	}
+	public override get movementSpeedBase(): number {}
 
 	public override get stealthPenalty(): number {
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] BlockStatement
entities/character/domain/ArmorStatsDecorator.ts:42:27
 
 	public override get movementSpeedBase(): number {
 		const baseSpeed = this.wrapped.movementSpeedBase;
-		if (this.setup.isHeavy) {
-			// Reduz em 3m a velocidade base do personagem
-			return Math.max(0, baseSpeed - 3);
-		}
+		if (this.setup.isHeavy) {}
 		return baseSpeed;
 	}
killedBy: createCombatAttackerStatsView shows derived stats with equipped heavy armor (+5 CA, 0 physical bonus, -3m speed)
statusReason: expected 'Velocidade: 9m' to be 'Velocidade: 6m' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ArmorStatsDecorator.ts:42:7
 
 	public override get movementSpeedBase(): number {
 		const baseSpeed = this.wrapped.movementSpeedBase;
-		if (this.setup.isHeavy) {
+		if (true) {
 			// Reduz em 3m a velocidade base do personagem
 			return Math.max(0, baseSpeed - 3);
killedBy: createCombatAttackerStatsView shows derived stats for a selected session character
statusReason: expected { carrySlotLimit: 10, …(13) } to deeply equal { …(14) }

[Killed] ArithmeticOperator
entities/character/domain/ArmorStatsDecorator.ts:44:23
 		const baseSpeed = this.wrapped.movementSpeedBase;
 		if (this.setup.isHeavy) {
 			// Reduz em 3m a velocidade base do personagem
-			return Math.max(0, baseSpeed - 3);
+			return Math.max(0, baseSpeed + 3);
 		}
 		return baseSpeed;
killedBy: createCombatAttackerStatsView shows derived stats with equipped heavy armor (+5 CA, 0 physical bonus, -3m speed)
statusReason: expected 'Velocidade: 12m' to be 'Velocidade: 6m' // Object.is equality

[Killed] MethodExpression
entities/character/domain/ArmorStatsDecorator.ts:44:11
 		const baseSpeed = this.wrapped.movementSpeedBase;
 		if (this.setup.isHeavy) {
 			// Reduz em 3m a velocidade base do personagem
-			return Math.max(0, baseSpeed - 3);
+			return Math.min(0, baseSpeed - 3);
 		}
 		return baseSpeed;
killedBy: createCombatAttackerStatsView shows derived stats with equipped heavy armor (+5 CA, 0 physical bonus, -3m speed)
statusReason: expected 'Velocidade: 0m' to be 'Velocidade: 6m' // Object.is equality

[Killed] BlockStatement
entities/character/domain/ArmorStatsDecorator.ts:49:47
 		return baseSpeed;
 	}
 
-	public override get stealthPenalty(): number {
-		const basePenalty = this.wrapped.stealthPenalty;
-		if (this.setup.isNoisy) {
-			// Armadura ruidosa aplica -2 em Furtividade
-			return basePenalty - 2;
-		}
-		return basePenalty;
-	}
+	public override get stealthPenalty(): number {}
 }
 
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha ArmorStatsDecorator & Classe de Armadura deve calcular a CA com armadura leve de couro (+2 CA, Físico completo, sem penalidades)
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ArmorStatsDecorator.ts:51:7
 
 	public override get stealthPenalty(): number {
 		const basePenalty = this.wrapped.stealthPenalty;
-		if (this.setup.isNoisy) {
+		if (true) {
 			// Armadura ruidosa aplica -2 em Furtividade
 			return basePenalty - 2;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha ArmorStatsDecorator & Classe de Armadura deve calcular a CA com armadura leve de couro (+2 CA, Físico completo, sem penalidades)
statusReason: expected -2 to be +0 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ArmorStatsDecorator.ts:51:7
 
 	public override get stealthPenalty(): number {
 		const basePenalty = this.wrapped.stealthPenalty;
-		if (this.setup.isNoisy) {
+		if (false) {
 			// Armadura ruidosa aplica -2 em Furtividade
 			return basePenalty - 2;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha ArmorStatsDecorator & Classe de Armadura deve calcular a CA com armadura pesada de placas (+5 CA, Físico zerado, -3m velocidade e -2 furtivida
statusReason: expected +0 to be -2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/ArmorStatsDecorator.ts:53:11
 		const basePenalty = this.wrapped.stealthPenalty;
 		if (this.setup.isNoisy) {
 			// Armadura ruidosa aplica -2 em Furtividade
-			return basePenalty - 2;
+			return basePenalty + 2;
 		}
 		return basePenalty;
killedBy: StatusEffectDecorator - Efeitos de Status do RPG Pandorha ArmorStatsDecorator & Classe de Armadura deve calcular a CA com armadura pesada de placas (+5 CA, Físico zerado, -3m velocidade e -2 furtivida
statusReason: expected 2 to be -2 // Object.is equality
