[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:19:7
 		input: unknown,
 	): Result<CharacterDerivedStatsResult, CharacterDerivedStatsFailure> {
 		const parsed = characterDerivedStatsInputSchema.safeParse(input);
-		if (!parsed.success) {
+		if (true) {
 			return fail({
 				code: "INVALID_DERIVED_STATS_INPUT",
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] BlockStatement
entities/character/domain/CharacterDerivedStatsService.ts:19:24
 		input: unknown,
 	): Result<CharacterDerivedStatsResult, CharacterDerivedStatsFailure> {
 		const parsed = characterDerivedStatsInputSchema.safeParse(input);
-		if (!parsed.success) {
-			return fail({
-				code: "INVALID_DERIVED_STATS_INPUT",
-				message: "Character derived stats input failed validation.",
-				details: { issues: formatIssues(parsed.error.issues) },
-			});
-		}
+		if (!parsed.success) {}
 
 		const { character, characterClass } = parsed.data;
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: Cannot destructure property 'character' of 'parsed.data' as it is undefined.

[Killed] StringLiteral
entities/character/domain/CharacterDerivedStatsService.ts:21:11
 		const parsed = characterDerivedStatsInputSchema.safeParse(input);
 		if (!parsed.success) {
 			return fail({
-				code: "INVALID_DERIVED_STATS_INPUT",
+				code: "",
 				message: "Character derived stats input failed validation.",
 				details: { issues: formatIssues(parsed.error.issues) },
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: expected '' to be 'INVALID_DERIVED_STATS_INPUT' // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/CharacterDerivedStatsService.ts:23:14
 			return fail({
 				code: "INVALID_DERIVED_STATS_INPUT",
 				message: "Character derived stats input failed validation.",
-				details: { issues: formatIssues(parsed.error.issues) },
+				details: {},
 			});
 		}
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:28:7
 		}
 
 		const { character, characterClass } = parsed.data;
-		if (character.classId !== characterClass.id) {
+		if (false) {
 			return fail({
 				code: "CHARACTER_CLASS_MISMATCH",
killedBy: CharacterDerivedStatsService rejects a class source that does not match the character class id
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
entities/character/domain/CharacterDerivedStatsService.ts:28:7
 		}
 
 		const { character, characterClass } = parsed.data;
-		if (character.classId !== characterClass.id) {
+		if (character.classId === characterClass.id) {
 			return fail({
 				code: "CHARACTER_CLASS_MISMATCH",
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/CharacterDerivedStatsService.ts:29:16
 
 		const { character, characterClass } = parsed.data;
 		if (character.classId !== characterClass.id) {
-			return fail({
-				code: "CHARACTER_CLASS_MISMATCH",
-				message:
-					"Resolved character class does not match the character record.",
-				details: {
-					characterClassId: character.classId,
-					resolvedClassId: characterClass.id,
-				},
-			});
+			return fail({});
 		}
 
killedBy: CharacterDerivedStatsService rejects a class source that does not match the character class id
statusReason: expected {} to match object { …(2) }

[Killed] EqualityOperator
entities/character/domain/CharacterDerivedStatsService.ts:41:42
 		}
 
 		const climaExtremo = parsed.data.climaExtremo;
-		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
+		const physical = character.physical - (climaExtremo !== "frost" ? 1 : 0);
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 15, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:41:20
 		}
 
 		const climaExtremo = parsed.data.climaExtremo;
-		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
+		const physical = character.physical + (climaExtremo === "frost" ? 1 : 0);
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
killedBy: CharacterDerivedStatsService applies frost weather modifier by subtracting 1 from physical
statusReason: expected 17 to be 15 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:42:38
 
 		const climaExtremo = parsed.data.climaExtremo;
 		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
-		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
+		const mental = character.mental - (false ? 1 : 0);
 
 		let initiativeBase = character.level + mental + character.interaction;
killedBy: CharacterDerivedStatsService applies heat weather modifier by subtracting 1 from mental
statusReason: expected 3 to be 2 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:42:38
 
 		const climaExtremo = parsed.data.climaExtremo;
 		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
-		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
+		const mental = character.mental - (true ? 1 : 0);
 
 		let initiativeBase = character.level + mental + character.interaction;
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 2, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:44:24
 		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
-		let initiativeBase = character.level + mental + character.interaction;
+		let initiativeBase = character.level + mental - character.interaction;
 		let armorClass = 10 + character.level + physical;
 
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 1, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:44:24
 		const physical = character.physical - (climaExtremo === "frost" ? 1 : 0);
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
-		let initiativeBase = character.level + mental + character.interaction;
+		let initiativeBase = character.level - mental + character.interaction;
 		let armorClass = 10 + character.level + physical;
 
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 1, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:45:20
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
 		let initiativeBase = character.level + mental + character.interaction;
-		let armorClass = 10 + character.level + physical;
+		let armorClass = 10 - character.level + physical;
 
 		if (climaExtremo === "storm") {
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:45:20
 		const mental = character.mental - (climaExtremo === "heat" ? 1 : 0);
 
 		let initiativeBase = character.level + mental + character.interaction;
-		let armorClass = 10 + character.level + physical;
+		let armorClass = 10 + character.level - physical;
 
 		if (climaExtremo === "storm") {
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:47:7
 		let initiativeBase = character.level + mental + character.interaction;
 		let armorClass = 10 + character.level + physical;
 
-		if (climaExtremo === "storm") {
+		if (false) {
 			initiativeBase -= 1;
 			armorClass -= 1;
killedBy: CharacterDerivedStatsService applies storm weather modifier by subtracting 1 from initiativeBase and armorClass
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BlockStatement
entities/character/domain/CharacterDerivedStatsService.ts:47:33
 		let initiativeBase = character.level + mental + character.interaction;
 		let armorClass = 10 + character.level + physical;
 
-		if (climaExtremo === "storm") {
-			initiativeBase -= 1;
-			armorClass -= 1;
-		}
+		if (climaExtremo === "storm") {}
 
 		return ok({
killedBy: CharacterDerivedStatsService applies storm weather modifier by subtracting 1 from initiativeBase and armorClass
statusReason: expected 3 to be 2 // Object.is equality

[Killed] AssignmentOperator
entities/character/domain/CharacterDerivedStatsService.ts:48:4
 		let armorClass = 10 + character.level + physical;
 
 		if (climaExtremo === "storm") {
-			initiativeBase -= 1;
+			initiativeBase += 1;
 			armorClass -= 1;
 		}
killedBy: CharacterDerivedStatsService applies storm weather modifier by subtracting 1 from initiativeBase and armorClass
statusReason: expected 4 to be 2 // Object.is equality

[Killed] AssignmentOperator
entities/character/domain/CharacterDerivedStatsService.ts:49:4
 
 		if (climaExtremo === "storm") {
 			initiativeBase -= 1;
-			armorClass -= 1;
+			armorClass += 1;
 		}
 
killedBy: CharacterDerivedStatsService applies storm weather modifier by subtracting 1 from initiativeBase and armorClass
statusReason: expected 15 to be 13 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:54:6
 
 		return ok({
 			maxHp:
-				(characterClass.baseHp + physical + character.resistance) *
+				(characterClass.baseHp + physical - character.resistance) *
 				character.level,
 			initiativeBase,
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 10, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:54:6
 
 		return ok({
 			maxHp:
-				(characterClass.baseHp + physical + character.resistance) *
+				(characterClass.baseHp - physical + character.resistance) *
 				character.level,
 			initiativeBase,
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 10, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:57:20
 				(characterClass.baseHp + physical + character.resistance) *
 				character.level,
 			initiativeBase,
-			carrySlotLimit: physical + character.resistance + 6,
+			carrySlotLimit: physical + character.resistance - 6,
 			armorClass,
 			stealthPenalty: 0,
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] ArithmeticOperator
entities/character/domain/CharacterDerivedStatsService.ts:57:20
 				(characterClass.baseHp + physical + character.resistance) *
 				character.level,
 			initiativeBase,
-			carrySlotLimit: physical + character.resistance + 6,
+			carrySlotLimit: physical - character.resistance + 6,
 			armorClass,
 			stealthPenalty: 0,
killedBy: CharacterDerivedStatsService calculates level-one Vanguarda derived stats from class base HP and character attributes
statusReason: expected { maxHp: 16, initiativeBase: 3, …(3) } to deeply equal { maxHp: 16, initiativeBase: 3, …(3) }

[Killed] BlockStatement
entities/character/domain/CharacterDerivedStatsService.ts:64:71
 	}
 }
 
-function formatIssues(issues: readonly ZodIssue[]): readonly string[] {
-	return issues.map(
-		(issue) => `${issue.path.join(".") || "root"}: ${issue.message}`,
-	);
-}
+function formatIssues(issues: readonly ZodIssue[]): readonly string[] {}
 
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
entities/character/domain/CharacterDerivedStatsService.ts:66:17
 
 function formatIssues(issues: readonly ZodIssue[]): readonly string[] {
 	return issues.map(
-		(issue) => `${issue.path.join(".") || "root"}: ${issue.message}`,
+		(issue) => `${false}: ${issue.message}`,
 	);
 }
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: expected [ Array(1) ] to include 'character.name: Too small: expected s…'

[Killed] LogicalOperator
entities/character/domain/CharacterDerivedStatsService.ts:66:17
 
 function formatIssues(issues: readonly ZodIssue[]): readonly string[] {
 	return issues.map(
-		(issue) => `${issue.path.join(".") || "root"}: ${issue.message}`,
+		(issue) => `${issue.path.join(".") && "root"}: ${issue.message}`,
 	);
 }
killedBy: CharacterDerivedStatsService rejects corrupted character records before calculating derived values
statusReason: expected [ Array(1) ] to include 'character.name: Too small: expected s…'
