[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:32:7
 		input: unknown,
 	): Promise<Result<CharacterRecord, CharacterFailure>> {
 		const parsedInput = characterCreateInputSchema.safeParse(input);
-		if (!parsedInput.success) {
+		if (false) {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: [GDD 00] Character creation 3x3 distribution rejects blank names at the Drizzle-Zod boundary
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:32:7
 		input: unknown,
 	): Promise<Result<CharacterRecord, CharacterFailure>> {
 		const parsedInput = characterCreateInputSchema.safeParse(input);
-		if (!parsedInput.success) {
+		if (true) {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] ObjectLiteral
entities/character/domain/CharacterService.ts:33:16
 	): Promise<Result<CharacterRecord, CharacterFailure>> {
 		const parsedInput = characterCreateInputSchema.safeParse(input);
 		if (!parsedInput.success) {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message: "Character input does not match the Drizzle-Zod schema.",
-				details: { issues: formatIssues(parsedInput.error.issues) },
-			});
+			return fail({});
 		}
 
killedBy: [GDD 00] Character creation 3x3 distribution rejects blank names at the Drizzle-Zod boundary
statusReason: expected undefined to be 'INVALID_CHARACTER_INPUT' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:41:7
 		}
 
 		const rules = validateCharacterCreationRules(parsedInput.data);
-		if (!rules.success) {
+		if (false) {
 			return rules;
 		}
killedBy: [GDD 00] Character creation 3x3 distribution rejects axes that do not spend exactly 6 points
statusReason: expected 'INVALID_CHARACTER_RECORD' to be 'INVALID_AXIS_DISTRIBUTION' // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/CharacterService.ts:41:7
 		}
 
 		const rules = validateCharacterCreationRules(parsedInput.data);
-		if (!rules.success) {
+		if (rules.success) {
 			return rules;
 		}
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: expected { name: 'Kael de Almar', …(12) } to match object { id: 'character-1', …(10) }
(5 matching properties omitted from actual)

[Killed] BooleanLiteral
entities/character/domain/CharacterService.ts:53:7
 			updatedAt: timestamp,
 		});
 
-		if (!candidate.success) {
+		if (candidate.success) {
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:53:7
 			updatedAt: timestamp,
 		});
 
-		if (!candidate.success) {
+		if (true) {
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] StringLiteral
entities/character/domain/CharacterService.ts:55:11
 
 		if (!candidate.success) {
 			return fail({
-				code: "INVALID_CHARACTER_RECORD",
+				code: "",
 				message: "Character record failed validation before persistence.",
 				details: { issues: formatIssues(candidate.error.issues) },
killedBy: [GDD 00] Character creation 3x3 distribution rejects invalid generated ids before persistence
statusReason: expected '' to be 'INVALID_CHARACTER_RECORD' // Object.is equality

[Survived] ObjectLiteral
entities/character/domain/CharacterService.ts:57:14
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
 				message: "Character record failed validation before persistence.",
-				details: { issues: formatIssues(candidate.error.issues) },
+				details: {},
 			});
 		}

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:62:7
 		}
 
 		const saved = await this.repository.save(candidate.data);
-		if (!saved.success) {
+		if (true) {
 			const repositoryFailure: CharacterFailure = {
 				code: "REPOSITORY_WRITE_FAILED",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
entities/character/domain/CharacterService.ts:62:7
 		}
 
 		const saved = await this.repository.save(candidate.data);
-		if (!saved.success) {
+		if (saved.success) {
 			const repositoryFailure: CharacterFailure = {
 				code: "REPOSITORY_WRITE_FAILED",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
entities/character/domain/CharacterService.ts:63:48
 
 		const saved = await this.repository.save(candidate.data);
 		if (!saved.success) {
-			const repositoryFailure: CharacterFailure = {
-				code: "REPOSITORY_WRITE_FAILED",
-				message: saved.error.message,
-			};
+			const repositoryFailure: CharacterFailure = {};
 
 			if (saved.error.details) {
killedBy: [GDD 00] Character creation 3x3 distribution maps repository failures into a service Result failure
statusReason: expected undefined to be 'REPOSITORY_WRITE_FAILED' // Object.is equality

[Killed] StringLiteral
entities/character/domain/CharacterService.ts:64:11
 		const saved = await this.repository.save(candidate.data);
 		if (!saved.success) {
 			const repositoryFailure: CharacterFailure = {
-				code: "REPOSITORY_WRITE_FAILED",
+				code: "",
 				message: saved.error.message,
 			};
killedBy: [GDD 00] Character creation 3x3 distribution maps repository failures into a service Result failure
statusReason: expected '' to be 'REPOSITORY_WRITE_FAILED' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:68:8
 				message: saved.error.message,
 			};
 
-			if (saved.error.details) {
+			if (false) {
 				return fail({ ...repositoryFailure, details: saved.error.details });
 			}
killedBy: [GDD 00] Character creation 3x3 distribution keeps repository failure details when the fake reports them
statusReason: expected undefined to deeply equal { cause: 'locked-save-slot' }

[Killed] BlockStatement
entities/character/domain/CharacterService.ts:68:29
 				message: saved.error.message,
 			};
 
-			if (saved.error.details) {
-				return fail({ ...repositoryFailure, details: saved.error.details });
-			}
+			if (saved.error.details) {}
 
 			return fail(repositoryFailure);
killedBy: [GDD 00] Character creation 3x3 distribution keeps repository failure details when the fake reports them
statusReason: expected undefined to deeply equal { cause: 'locked-save-slot' }

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:76:7
 		}
 
 		const output = characterSelectSchema.safeParse(saved.data);
-		if (!output.success) {
+		if (true) {
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
entities/character/domain/CharacterService.ts:76:7
 		}
 
 		const output = characterSelectSchema.safeParse(saved.data);
-		if (!output.success) {
+		if (output.success) {
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
killedBy: [GDD 00] Character creation 3x3 distribution creates a valid level 1 character through Drizzle-Zod validation and the fake repository
statusReason: Cannot read properties of undefined (reading 'issues')

[Survived] StringLiteral
entities/character/domain/CharacterService.ts:79:14
 		if (!output.success) {
 			return fail({
 				code: "INVALID_CHARACTER_RECORD",
-				message: "Persisted character record failed output validation.",
+				message: "",
 				details: { issues: formatIssues(output.error.issues) },
 			});

[Killed] BlockStatement
entities/character/domain/CharacterService.ts:92:42
 		isResurrectionBlockedFn: () => Promise<Result<boolean, unknown>>,
 	): Promise<Result<{ status: "resurrected" }, CharacterFailure>> {
 		const blockRes = await isResurrectionBlockedFn();
-		if (blockRes.success && blockRes.data) {
-			return fail({
-				code: "RESURRECTION_BLOCKED",
-				message:
-					"Ressurreição bloqueada por dívidas de sangue ou alma penhorada.",
-			});
-		}
+		if (blockRes.success && blockRes.data) {}
 
 		const charRes = await this.repository.findById(characterId);
killedBy: CharacterService resurrection rules deve bloquear a ressurreição caso exista pendência de alma ou dívida de sangue
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
entities/character/domain/CharacterService.ts:92:7
 		isResurrectionBlockedFn: () => Promise<Result<boolean, unknown>>,
 	): Promise<Result<{ status: "resurrected" }, CharacterFailure>> {
 		const blockRes = await isResurrectionBlockedFn();
-		if (blockRes.success && blockRes.data) {
+		if (blockRes.success || blockRes.data) {
 			return fail({
 				code: "RESURRECTION_BLOCKED",
killedBy: CharacterService resurrection rules deve ressuscitar personagem com sucesso quando ressurreição não estiver bloqueada
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:101:7
 		}
 
 		const charRes = await this.repository.findById(characterId);
-		if (!charRes.success) {
+		if (false) {
 			return fail({
 				code: "REPOSITORY_READ_FAILED",
killedBy: CharacterService resurrection rules deve falhar a ressurreição se a leitura ou gravação do repositório falharem
statusReason: Cannot set properties of undefined (setting 'updatedAt')

[Killed] StringLiteral
entities/character/domain/CharacterService.ts:103:11
 		const charRes = await this.repository.findById(characterId);
 		if (!charRes.success) {
 			return fail({
-				code: "REPOSITORY_READ_FAILED",
+				code: "",
 				message: charRes.error.message,
 			});
killedBy: CharacterService resurrection rules deve falhar a ressurreição se a leitura ou gravação do repositório falharem
statusReason: expected '' to be 'REPOSITORY_READ_FAILED' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:112:7
 		char.updatedAt = this.clock.now();
 
 		const saveRes = await this.repository.save(char);
-		if (!saveRes.success) {
+		if (false) {
 			return fail({
 				code: "REPOSITORY_WRITE_FAILED",
killedBy: CharacterService resurrection rules deve falhar a ressurreição se a leitura ou gravação do repositório falharem
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/CharacterService.ts:112:7
 		char.updatedAt = this.clock.now();
 
 		const saveRes = await this.repository.save(char);
-		if (!saveRes.success) {
+		if (true) {
 			return fail({
 				code: "REPOSITORY_WRITE_FAILED",
killedBy: CharacterService resurrection rules deve ressuscitar personagem com sucesso quando ressurreição não estiver bloqueada
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
entities/character/domain/CharacterService.ts:119:23
 			});
 		}
 
-		return ok({ status: "resurrected" });
+		return ok({ status: "" });
 	}
 }
killedBy: CharacterService resurrection rules deve ressuscitar personagem com sucesso quando ressurreição não estiver bloqueada
statusReason: expected '' to be 'resurrected' // Object.is equality
