[Killed] EqualityOperator
entities/character/domain/ClassTalentService.ts:39:7
 			CharacterFailure
 		>
 	> {
-		if (currentPv < 2) {
+		if (currentPv <= 2) {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o personagem não for Vanguarda
statusReason: expected 'Pontos de Vigor (PV) insuficientes pa…' to contain 'Apenas personagens da classe Vanguarda'

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:39:22
 			CharacterFailure
 		>
 	> {
-		if (currentPv < 2) {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message: "Pontos de Vigor (PV) insuficientes para ativar Fôlego Extra.",
-			});
-		}
+		if (currentPv < 2) {}
 
 		const charRes = await this.repository.findById(characterId);
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se os pontos de Vigor (PV) forem insuficientes (< 2)
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/ClassTalentService.ts:40:16
 		>
 	> {
 		if (currentPv < 2) {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message: "Pontos de Vigor (PV) insuficientes para ativar Fôlego Extra.",
-			});
+			return fail({});
 		}
 
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se os pontos de Vigor (PV) forem insuficientes (< 2)
statusReason: expected undefined to be 'INVALID_CHARACTER_INPUT' // Object.is equality

[Killed] EqualityOperator
entities/character/domain/ClassTalentService.ts:54:7
 			});
 		}
 
-		if (charRes.data.classId !== "vanguard") {
+		if (charRes.data.classId === "vanguard") {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Fôlego Extra para personagem Vanguarda com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:54:44
 			});
 		}
 
-		if (charRes.data.classId !== "vanguard") {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message:
-					"Apenas personagens da classe Vanguarda podem ativar Fôlego Extra.",
-			});
-		}
+		if (charRes.data.classId !== "vanguard") {}
 
 		const existingResult =
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o personagem não for Vanguarda
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
entities/character/domain/ClassTalentService.ts:72:25
 			});
 		}
 
-		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "extra_breath",
-		);
+		const alreadyActive = existingResult.data.every(e => e.type === "extra_breath");
 		if (alreadyActive) {
 			return fail({
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Fôlego Extra para personagem Vanguarda com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
entities/character/domain/ClassTalentService.ts:73:4
 		}
 
 		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "extra_breath",
+			() => undefined,
 		);
 		if (alreadyActive) {
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
entities/character/domain/ClassTalentService.ts:73:11
 		}
 
 		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "extra_breath",
+			(e) => e.type !== "extra_breath",
 		);
 		if (alreadyActive) {
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ClassTalentService.ts:75:7
 		const alreadyActive = existingResult.data.some(
 			(e) => e.type === "extra_breath",
 		);
-		if (alreadyActive) {
+		if (true) {
 			return fail({
 				code: "ALREADY_INFECTED",
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Fôlego Extra para personagem Vanguarda com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ClassTalentService.ts:75:7
 		const alreadyActive = existingResult.data.some(
 			(e) => e.type === "extra_breath",
 		);
-		if (alreadyActive) {
+		if (false) {
 			return fail({
 				code: "ALREADY_INFECTED",
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/ClassTalentService.ts:76:16
 			(e) => e.type === "extra_breath",
 		);
 		if (alreadyActive) {
-			return fail({
-				code: "ALREADY_INFECTED",
-				message: "O personagem já está sob o efeito de Fôlego Extra.",
-			});
+			return fail({});
 		}
 
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Fôlego Extra se o efeito já estiver ativo
statusReason: expected undefined to be 'ALREADY_INFECTED' // Object.is equality

[Survived] StringLiteral
entities/character/domain/ClassTalentService.ts:78:14
 		if (alreadyActive) {
 			return fail({
 				code: "ALREADY_INFECTED",
-				message: "O personagem já está sob o efeito de Fôlego Extra.",
+				message: "",
 			});
 		}

[Survived] BooleanLiteral
entities/character/domain/ClassTalentService.ts:89:18
 			type: "extra_breath",
 			severity: 1,
 			severityMax: 1,
-			isAggravated: false,
+			isAggravated: true,
 			durationTurns: 3,
 			createdAt: timestamp,

[Killed] BooleanLiteral
entities/character/domain/ClassTalentService.ts:96:7
 		};
 
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
-		if (!savedResult.success) {
+		if (savedResult.success) {
 			return fail({
 				code: "PERSIST_STATUS_EFFECT_FAILED",
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Fôlego Extra para personagem Vanguarda com recursos suficientes
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:96:29
 		};
 
 		const savedResult = await this.repository.saveStatusEffect(effectRecord);
-		if (!savedResult.success) {
-			return fail({
-				code: "PERSIST_STATUS_EFFECT_FAILED",
-				message: savedResult.error.message,
-			});
-		}
+		if (!savedResult.success) {}
 
 		return ok({ effect: savedResult.data, costPv: 2 });
killedBy: ClassTalentService - Talentos de Classe Táticos Failure branches coverage (Repository Errors) deve cobrir falhas de repositório no activateExtraBreath
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:119:22
 			CharacterFailure
 		>
 	> {
-		if (currentEe < 2) {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message: "Energia Etérica (EE) insuficiente para ativar Dobrar Tempo.",
-			});
-		}
+		if (currentEe < 2) {}
 
 		const charRes = await this.repository.findById(characterId);
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se a Energia Etérica (EE) for insuficiente (< 2)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ClassTalentService.ts:119:7
 			CharacterFailure
 		>
 	> {
-		if (currentEe < 2) {
+		if (true) {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Dobrar Tempo para personagem Tecelão com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
entities/character/domain/ClassTalentService.ts:122:14
 		if (currentEe < 2) {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
-				message: "Energia Etérica (EE) insuficiente para ativar Dobrar Tempo.",
+				message: "",
 			});
 		}
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se a Energia Etérica (EE) for insuficiente (< 2)
statusReason: expected '' to contain 'Energia Etérica (EE) insuficiente'

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:127:25
 		}
 
 		const charRes = await this.repository.findById(characterId);
-		if (!charRes.success) {
-			return fail({
-				code: "REPOSITORY_READ_FAILED",
-				message: charRes.error.message,
-			});
-		}
+		if (!charRes.success) {}
 
 		if (charRes.data.classId !== "weaver") {
killedBy: ClassTalentService - Talentos de Classe Táticos Failure branches coverage (Repository Errors) deve cobrir falhas de repositório no activateDoubleTime
statusReason: Cannot read properties of undefined (reading 'classId')

[Killed] ObjectLiteral
entities/character/domain/ClassTalentService.ts:128:16
 
 		const charRes = await this.repository.findById(characterId);
 		if (!charRes.success) {
-			return fail({
-				code: "REPOSITORY_READ_FAILED",
-				message: charRes.error.message,
-			});
+			return fail({});
 		}
 
killedBy: ClassTalentService - Talentos de Classe Táticos Failure branches coverage (Repository Errors) deve cobrir falhas de repositório no activateDoubleTime
statusReason: expected undefined to be 'REPOSITORY_READ_FAILED' // Object.is equality

[Killed] EqualityOperator
entities/character/domain/ClassTalentService.ts:134:7
 			});
 		}
 
-		if (charRes.data.classId !== "weaver") {
+		if (charRes.data.classId === "weaver") {
 			return fail({
 				code: "INVALID_CHARACTER_INPUT",
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Dobrar Tempo para personagem Tecelão com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:134:42
 			});
 		}
 
-		if (charRes.data.classId !== "weaver") {
-			return fail({
-				code: "INVALID_CHARACTER_INPUT",
-				message:
-					"Apenas personagens da classe Tecelão podem ativar Dobrar Tempo.",
-			});
-		}
+		if (charRes.data.classId !== "weaver") {}
 
 		const existingResult =
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se o personagem não for Tecelão
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
entities/character/domain/ClassTalentService.ts:136:11
 
 		if (charRes.data.classId !== "weaver") {
 			return fail({
-				code: "INVALID_CHARACTER_INPUT",
+				code: "",
 				message:
 					"Apenas personagens da classe Tecelão podem ativar Dobrar Tempo.",
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se o personagem não for Tecelão
statusReason: expected '' to be 'INVALID_CHARACTER_INPUT' // Object.is equality

[Survived] StringLiteral
entities/character/domain/ClassTalentService.ts:148:6
 			return fail({
 				code: "FETCH_STATUS_EFFECTS_FAILED",
 				message:
-					"Não foi possível verificar os efeitos de status do personagem.",
+					"",
 			});
 		}

[Killed] MethodExpression
entities/character/domain/ClassTalentService.ts:152:25
 			});
 		}
 
-		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "double_time",
-		);
+		const alreadyActive = existingResult.data.every(e => e.type === "double_time");
 		if (alreadyActive) {
 			return fail({
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Dobrar Tempo para personagem Tecelão com recursos suficientes
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
entities/character/domain/ClassTalentService.ts:153:4
 		}
 
 		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "double_time",
+			() => undefined,
 		);
 		if (alreadyActive) {
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/ClassTalentService.ts:153:11
 		}
 
 		const alreadyActive = existingResult.data.some(
-			(e) => e.type === "double_time",
+			(e) => false,
 		);
 		if (alreadyActive) {
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/ClassTalentService.ts:155:22
 		const alreadyActive = existingResult.data.some(
 			(e) => e.type === "double_time",
 		);
-		if (alreadyActive) {
-			return fail({
-				code: "ALREADY_INFECTED",
-				message: "O personagem já está sob o efeito de Dobrar Tempo.",
-			});
-		}
+		if (alreadyActive) {}
 
 		const timestamp = this.clock.now();
killedBy: ClassTalentService - Talentos de Classe Táticos deve rejeitar Dobrar Tempo se o efeito já estiver ativo
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
entities/character/domain/ClassTalentService.ts:166:10
 		const effectRecord: NewCharacterStatusEffectRecord = {
 			id: this.idProvider.generate(),
 			characterId,
-			type: "double_time",
+			type: "",
 			severity: 1,
 			severityMax: 1,
killedBy: ClassTalentService - Talentos de Classe Táticos deve ativar Dobrar Tempo para personagem Tecelão com recursos suficientes
statusReason: expected false to be true // Object.is equality
