[Killed] BlockStatement
entities/character/domain/LimitBreakService.ts:21:48
 	public accumulateTension(
 		character: CharacterRecord,
 		trigger: LimitBreakTrigger,
-	): Result<CharacterRecord, LimitBreakFailure> {
-		let amount = 0;
-		switch (trigger) {
-			case "massive_damage":
-				amount = 30;
-				break;
-			case "adjacent_ally_down":
-				amount = 40;
-				break;
-			case "lethal_precision":
-				amount = 30;
-				break;
-		}
-
-		const currentTension = character.tensionMeter ?? 0;
-		const newTension = Math.min(100, Math.max(0, currentTension + amount));
-
-		const updated: CharacterRecord = {
-			...character,
-			tensionMeter: newTension,
-			updatedAt: new Date().toISOString(),
-		};
-
-		return ok(updated);
-	}
+	): Result<CharacterRecord, LimitBreakFailure> {}
 
 	public consumeLimitBreak(
killedBy: LimitBreakService accumulateTension should add 30 tension on massive_damage trigger
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
entities/character/domain/LimitBreakService.ts:24:4
 	): Result<CharacterRecord, LimitBreakFailure> {
 		let amount = 0;
 		switch (trigger) {
-			case "massive_damage":
-				amount = 30;
-				break;
+			case "massive_damage":
 			case "adjacent_ally_down":
 				amount = 40;
killedBy: LimitBreakService accumulateTension should add 30 tension on massive_damage trigger
statusReason: expected 40 to be 30 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/LimitBreakService.ts:27:4
 			case "massive_damage":
 				amount = 30;
 				break;
-			case "adjacent_ally_down":
-				amount = 40;
-				break;
+			case "adjacent_ally_down":
 			case "lethal_precision":
 				amount = 30;
killedBy: LimitBreakService accumulateTension should add 40 tension on adjacent_ally_down trigger
statusReason: expected 30 to be 40 // Object.is equality

[Killed] StringLiteral
entities/character/domain/LimitBreakService.ts:27:9
 			case "massive_damage":
 				amount = 30;
 				break;
-			case "adjacent_ally_down":
+			case "":
 				amount = 40;
 				break;
killedBy: LimitBreakService accumulateTension should add 40 tension on adjacent_ally_down trigger
statusReason: expected +0 to be 40 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/LimitBreakService.ts:30:4
 			case "adjacent_ally_down":
 				amount = 40;
 				break;
-			case "lethal_precision":
-				amount = 30;
-				break;
+			case "lethal_precision":
 		}
 
killedBy: LimitBreakService accumulateTension should add 30 tension on lethal_precision trigger
statusReason: expected +0 to be 30 // Object.is equality

[Killed] StringLiteral
entities/character/domain/LimitBreakService.ts:30:9
 			case "adjacent_ally_down":
 				amount = 40;
 				break;
-			case "lethal_precision":
+			case "":
 				amount = 30;
 				break;
killedBy: LimitBreakService accumulateTension should add 30 tension on lethal_precision trigger
statusReason: expected +0 to be 30 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/LimitBreakService.ts:35:26
 				break;
 		}
 
-		const currentTension = character.tensionMeter ?? 0;
+		const currentTension = character.tensionMeter && 0;
 		const newTension = Math.min(100, Math.max(0, currentTension + amount));
 
killedBy: LimitBreakService accumulateTension should cap tension accumulation at 100
statusReason: expected 30 to be 100 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/LimitBreakService.ts:36:48
 		}
 
 		const currentTension = character.tensionMeter ?? 0;
-		const newTension = Math.min(100, Math.max(0, currentTension + amount));
+		const newTension = Math.min(100, Math.max(0, currentTension - amount));
 
 		const updated: CharacterRecord = {
killedBy: LimitBreakService accumulateTension should add 30 tension on massive_damage trigger
statusReason: expected +0 to be 30 // Object.is equality

[Killed] MethodExpression
entities/character/domain/LimitBreakService.ts:36:36
 		}
 
 		const currentTension = character.tensionMeter ?? 0;
-		const newTension = Math.min(100, Math.max(0, currentTension + amount));
+		const newTension = Math.min(100, Math.min(0, currentTension + amount));
 
 		const updated: CharacterRecord = {
killedBy: LimitBreakService accumulateTension should add 30 tension on massive_damage trigger
statusReason: expected +0 to be 30 // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/LimitBreakService.ts:38:36
 		const currentTension = character.tensionMeter ?? 0;
 		const newTension = Math.min(100, Math.max(0, currentTension + amount));
 
-		const updated: CharacterRecord = {
-			...character,
-			tensionMeter: newTension,
-			updatedAt: new Date().toISOString(),
-		};
+		const updated: CharacterRecord = {};
 
 		return ok(updated);
killedBy: LimitBreakService accumulateTension should add 30 tension on massive_damage trigger
statusReason: expected undefined to be 30 // Object.is equality

[Killed] BlockStatement
entities/character/domain/LimitBreakService.ts:49:48
 
 	public consumeLimitBreak(
 		character: CharacterRecord,
-	): Result<CharacterRecord, LimitBreakFailure> {
-		const updated: CharacterRecord = {
-			...character,
-			tensionMeter: 0,
-			updatedAt: new Date().toISOString(),
-		};
-
-		return ok(updated);
-	}
+	): Result<CharacterRecord, LimitBreakFailure> {}
 }
 
killedBy: LimitBreakService consumeLimitBreak should reset tension to 0
statusReason: Cannot read properties of undefined (reading 'success')
