[Killed] BlockStatement
entities/character/domain/RetrainService.ts:47:25
 		readonly currentDowntimeDays: number;
 	}): Promise<Result<RetrainResult, RetrainFailure>> {
 		const charRes = await this.repository.findById(params.characterId);
-		if (!charRes.success) {
-			return fail({
-				code: "CHARACTER_NOT_FOUND",
-				message: "Personagem não encontrado no registro para retreino.",
-			});
-		}
+		if (!charRes.success) {}
 
 		const character = charRes.data;
killedBy: RetrainService deve retornar erro de personagem nao encontrado em retrainTalent
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:47:7
 		readonly currentDowntimeDays: number;
 	}): Promise<Result<RetrainResult, RetrainFailure>> {
 		const charRes = await this.repository.findById(params.characterId);
-		if (!charRes.success) {
+		if (true) {
 			return fail({
 				code: "CHARACTER_NOT_FOUND",
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:49:11
 		const charRes = await this.repository.findById(params.characterId);
 		if (!charRes.success) {
 			return fail({
-				code: "CHARACTER_NOT_FOUND",
+				code: "",
 				message: "Personagem não encontrado no registro para retreino.",
 			});
killedBy: RetrainService deve retornar erro de personagem nao encontrado em retrainTalent
statusReason: expected '' to be 'CHARACTER_NOT_FOUND' // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:55:20
 		}
 
 		const character = charRes.data;
-		const goldCost = character.level * 10;
+		const goldCost = character.level / 10;
 		const downtimeCost = 3;
 
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected 0.3 to be 30 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/RetrainService.ts:60:20
 
 		// Valida ouro do personagem
 		// biome-ignore lint/suspicious/noExplicitAny: gold is on the character record runtime state
-		const charGold = (character as any).gold ?? 0;
+		const charGold = (character as any).gold && 0;
 		if (charGold < goldCost) {
 			return fail({
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
entities/character/domain/RetrainService.ts:61:7
 		// Valida ouro do personagem
 		// biome-ignore lint/suspicious/noExplicitAny: gold is on the character record runtime state
 		const charGold = (character as any).gold ?? 0;
-		if (charGold < goldCost) {
+		if (charGold >= goldCost) {
 			return fail({
 				code: "INSUFFICIENT_GOLD",
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:61:7
 		// Valida ouro do personagem
 		// biome-ignore lint/suspicious/noExplicitAny: gold is on the character record runtime state
 		const charGold = (character as any).gold ?? 0;
-		if (charGold < goldCost) {
+		if (false) {
 			return fail({
 				code: "INSUFFICIENT_GOLD",
killedBy: RetrainService should fail talent retraining if gold is insufficient
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:62:16
 		// biome-ignore lint/suspicious/noExplicitAny: gold is on the character record runtime state
 		const charGold = (character as any).gold ?? 0;
 		if (charGold < goldCost) {
-			return fail({
-				code: "INSUFFICIENT_GOLD",
-				message: `Ouro insuficiente para retreinar talento. Requer ${goldCost} PO, possui ${charGold} PO.`,
-			});
+			return fail({});
 		}
 
killedBy: RetrainService should fail talent retraining if gold is insufficient
statusReason: expected undefined to be 'INSUFFICIENT_GOLD' // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:63:11
 		const charGold = (character as any).gold ?? 0;
 		if (charGold < goldCost) {
 			return fail({
-				code: "INSUFFICIENT_GOLD",
+				code: "",
 				message: `Ouro insuficiente para retreinar talento. Requer ${goldCost} PO, possui ${charGold} PO.`,
 			});
killedBy: RetrainService should fail talent retraining if gold is insufficient
statusReason: expected '' to be 'INSUFFICIENT_GOLD' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:69:7
 		}
 
 		// Valida tempo de downtime
-		if (params.currentDowntimeDays < downtimeCost) {
+		if (true) {
 			return fail({
 				code: "INSUFFICIENT_DOWNTIME",
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:69:7
 		}
 
 		// Valida tempo de downtime
-		if (params.currentDowntimeDays < downtimeCost) {
+		if (false) {
 			return fail({
 				code: "INSUFFICIENT_DOWNTIME",
killedBy: RetrainService should fail talent retraining if downtime days are insufficient
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:79:22
 		// Deduz ouro e salva personagem
 		const updatedChar = {
 			...character,
-			gold: Math.max(0, charGold - goldCost),
+			gold: Math.max(0, charGold + goldCost),
 			updatedAt: new Date().toISOString(),
 		};
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected 130 to be 70 // Object.is equality

[Killed] MethodExpression
entities/character/domain/RetrainService.ts:79:10
 		// Deduz ouro e salva personagem
 		const updatedChar = {
 			...character,
-			gold: Math.max(0, charGold - goldCost),
+			gold: Math.min(0, charGold - goldCost),
 			updatedAt: new Date().toISOString(),
 		};
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected +0 to be 70 // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:84:7
 		};
 
 		const saveRes = await this.repository.save(updatedChar);
-		if (!saveRes.success) {
+		if (saveRes.success) {
 			return fail({
 				code: "REPOSITORY_ERROR",
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:84:7
 		};
 
 		const saveRes = await this.repository.save(updatedChar);
-		if (!saveRes.success) {
+		if (true) {
 			return fail({
 				code: "REPOSITORY_ERROR",
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:85:16
 
 		const saveRes = await this.repository.save(updatedChar);
 		if (!saveRes.success) {
-			return fail({
-				code: "REPOSITORY_ERROR",
-				message: "Falha ao salvar modificações do personagem no SQLite.",
-			});
+			return fail({});
 		}
 
killedBy: RetrainService deve retornar erro de salvamento de personagem ao retrainTalent
statusReason: expected undefined to be 'REPOSITORY_ERROR' // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:86:11
 		const saveRes = await this.repository.save(updatedChar);
 		if (!saveRes.success) {
 			return fail({
-				code: "REPOSITORY_ERROR",
+				code: "",
 				message: "Falha ao salvar modificações do personagem no SQLite.",
 			});
killedBy: RetrainService deve retornar erro de salvamento de personagem ao retrainTalent
statusReason: expected '' to be 'REPOSITORY_ERROR' // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:91:13
 			});
 		}
 
-		return ok({
-			character: saveRes.data,
-			goldSpent: goldCost,
-			downtimeDaysSpent: downtimeCost,
-		});
+		return ok({});
 	}
 
killedBy: RetrainService should retrain a talent successfully when gold and downtime are sufficient
statusReason: expected undefined to be 30 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:108:7
 		readonly currentDowntimeDays: number;
 	}): Promise<Result<ReconditionResult, RetrainFailure>> {
 		const charRes = await this.repository.findById(params.characterId);
-		if (!charRes.success) {
+		if (false) {
 			return fail({
 				code: "CHARACTER_NOT_FOUND",
killedBy: RetrainService deve retornar erro de personagem nao encontrado em reconditionAxis
statusReason: Cannot read properties of undefined (reading 'level')

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:108:25
 		readonly currentDowntimeDays: number;
 	}): Promise<Result<ReconditionResult, RetrainFailure>> {
 		const charRes = await this.repository.findById(params.characterId);
-		if (!charRes.success) {
-			return fail({
-				code: "CHARACTER_NOT_FOUND",
-				message: "Personagem não encontrado para recondicionamento de eixo.",
-			});
-		}
+		if (!charRes.success) {}
 
 		const character = charRes.data;
killedBy: RetrainService deve retornar erro de personagem nao encontrado em reconditionAxis
statusReason: Cannot read properties of undefined (reading 'level')

[Survived] StringLiteral
entities/character/domain/RetrainService.ts:111:14
 		if (!charRes.success) {
 			return fail({
 				code: "CHARACTER_NOT_FOUND",
-				message: "Personagem não encontrado para recondicionamento de eixo.",
+				message: "",
 			});
 		}

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:116:20
 		}
 
 		const character = charRes.data;
-		const goldCost = character.level * 30; // 3x custo de talento
+		const goldCost = character.level / 30; // 3x custo de talento
 		const downtimeCost = 9; // 3x tempo de talento
 
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected 0.1 to be 90 // Object.is equality

[Killed] LogicalOperator
entities/character/domain/RetrainService.ts:120:20
 		const downtimeCost = 9; // 3x tempo de talento
 
 		// biome-ignore lint/suspicious/noExplicitAny: gold runtime check
-		const charGold = (character as any).gold ?? 0;
+		const charGold = (character as any).gold && 0;
 		if (charGold < goldCost) {
 			return fail({
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:121:28
 
 		// biome-ignore lint/suspicious/noExplicitAny: gold runtime check
 		const charGold = (character as any).gold ?? 0;
-		if (charGold < goldCost) {
-			return fail({
-				code: "INSUFFICIENT_GOLD",
-				message: `Ouro insuficiente para recondicionar eixo. Requer ${goldCost} PO, possui ${charGold} PO.`,
-			});
-		}
+		if (charGold < goldCost) {}
 
 		if (params.currentDowntimeDays < downtimeCost) {
killedBy: RetrainService deve retornar erro de ouro insuficiente ao recondicionar eixo
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:128:50
 			});
 		}
 
-		if (params.currentDowntimeDays < downtimeCost) {
-			return fail({
-				code: "INSUFFICIENT_DOWNTIME",
-				message: `Tempo de Downtime insuficiente para recondicionamento. Requer ${downtimeCost} dias, possui ${params.currentDowntimeDays} dias.`,
-			});
-		}
+		if (params.currentDowntimeDays < downtimeCost) {}
 
 		// Deduz ouro
killedBy: RetrainService deve retornar erro de downtime insuficiente ao recondicionar eixo
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
entities/character/domain/RetrainService.ts:128:7
 			});
 		}
 
-		if (params.currentDowntimeDays < downtimeCost) {
+		if (params.currentDowntimeDays >= downtimeCost) {
 			return fail({
 				code: "INSUFFICIENT_DOWNTIME",
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:129:16
 		}
 
 		if (params.currentDowntimeDays < downtimeCost) {
-			return fail({
-				code: "INSUFFICIENT_DOWNTIME",
-				message: `Tempo de Downtime insuficiente para recondicionamento. Requer ${downtimeCost} dias, possui ${params.currentDowntimeDays} dias.`,
-			});
+			return fail({});
 		}
 
killedBy: RetrainService deve retornar erro de downtime insuficiente ao recondicionar eixo
statusReason: expected undefined to be 'INSUFFICIENT_DOWNTIME' // Object.is equality

[Survived] StringLiteral
entities/character/domain/RetrainService.ts:131:14
 		if (params.currentDowntimeDays < downtimeCost) {
 			return fail({
 				code: "INSUFFICIENT_DOWNTIME",
-				message: `Tempo de Downtime insuficiente para recondicionamento. Requer ${downtimeCost} dias, possui ${params.currentDowntimeDays} dias.`,
+				message: ``,
 			});
 		}

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:136:23
 		}
 
 		// Deduz ouro
-		const updatedChar = {
-			...character,
-			gold: Math.max(0, charGold - goldCost),
-			// Altera o valor correspondente no eixo correspondente
-			[params.axisToReplace]: Math.max(
-				1,
-				// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-				(character as any)[params.axisToReplace] - 1,
-			),
-			// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-			[params.newAxis]: ((character as any)[params.newAxis] || 0) + 1,
-			updatedAt: new Date().toISOString(),
-		};
+		const updatedChar = {};
 
 		const saveRes = await this.repository.save(updatedChar);
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected undefined to be 2 // Object.is equality

[Killed] MethodExpression
entities/character/domain/RetrainService.ts:140:28
 			...character,
 			gold: Math.max(0, charGold - goldCost),
 			// Altera o valor correspondente no eixo correspondente
-			[params.axisToReplace]: Math.max(
-				1,
-				// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-				(character as any)[params.axisToReplace] - 1,
-			),
+			[params.axisToReplace]: Math.min(1,
+// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
+(character as any)[params.axisToReplace] - 1),
 			// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
 			[params.newAxis]: ((character as any)[params.newAxis] || 0) + 1,
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:143:5
 			[params.axisToReplace]: Math.max(
 				1,
 				// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-				(character as any)[params.axisToReplace] - 1,
+				// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
+(character as any)[params.axisToReplace] + 1,
 			),
 			// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:146:23
 				(character as any)[params.axisToReplace] - 1,
 			),
 			// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-			[params.newAxis]: ((character as any)[params.newAxis] || 0) + 1,
+			[params.newAxis]: (true) + 1,
 			updatedAt: new Date().toISOString(),
 		};
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected 2 to be 3 // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:146:22
 				(character as any)[params.axisToReplace] - 1,
 			),
 			// biome-ignore lint/suspicious/noExplicitAny: axes dynamic modification
-			[params.newAxis]: ((character as any)[params.newAxis] || 0) + 1,
+			[params.newAxis]: ((character as any)[params.newAxis] || 0) - 1,
 			updatedAt: new Date().toISOString(),
 		};
killedBy: RetrainService should recondition an axis successfully, updating values and applying latent discoordination status
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:151:7
 		};
 
 		const saveRes = await this.repository.save(updatedChar);
-		if (!saveRes.success) {
+		if (false) {
 			return fail({
 				code: "REPOSITORY_ERROR",
killedBy: RetrainService deve retornar erro de salvamento de personagem ao recondicionar eixo
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:152:16
 
 		const saveRes = await this.repository.save(updatedChar);
 		if (!saveRes.success) {
-			return fail({
-				code: "REPOSITORY_ERROR",
-				message: "Falha ao salvar eixos modificados do personagem no SQLite.",
-			});
+			return fail({});
 		}
 
killedBy: RetrainService deve retornar erro de salvamento de personagem ao recondicionar eixo
statusReason: expected undefined to be 'REPOSITORY_ERROR' // Object.is equality

[Survived] BooleanLiteral
entities/character/domain/RetrainService.ts:165:18
 			type: "latent_discoordination",
 			severity: 3, // 3 testes sob desvantagem
 			severityMax: 3,
-			isAggravated: false,
+			isAggravated: true,
 			metadata: params.newAxis, // Armazena o eixo sob descoordenação no metadata
 			createdAt: new Date().toISOString(),

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:170:33
 			createdAt: new Date().toISOString(),
 		});
 
-		if (!statusEffectRes.success) {
-			return fail({
-				code: "STATUS_EFFECT_ERROR",
-				message:
-					"Falha ao gravar o status de Descoordenação Latente no personagem.",
-			});
-		}
+		if (!statusEffectRes.success) {}
 
 		return ok({
killedBy: RetrainService deve retornar erro de status effect ao falhar em reconditionAxis
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:170:7
 			createdAt: new Date().toISOString(),
 		});
 
-		if (!statusEffectRes.success) {
+		if (false) {
 			return fail({
 				code: "STATUS_EFFECT_ERROR",
killedBy: RetrainService deve retornar erro de status effect ao falhar em reconditionAxis
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:194:7
 		readonly currentDowntimeDays: number;
 	}): Promise<Result<RetrainResult, RetrainFailure>> {
 		const charRes = await this.repository.findById(params.characterId);
-		if (!charRes.success) {
+		if (charRes.success) {
 			return fail({
 				code: "CHARACTER_NOT_FOUND",
killedBy: RetrainService should retrain familiar successfully for flat cost of 50 gold and 3 days
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
entities/character/domain/RetrainService.ts:197:14
 		if (!charRes.success) {
 			return fail({
 				code: "CHARACTER_NOT_FOUND",
-				message: "Personagem não encontrado para retreino do familiar.",
+				message: "",
 			});
 		}

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:207:7
 
 		// biome-ignore lint/suspicious/noExplicitAny: gold runtime check
 		const charGold = (character as any).gold ?? 0;
-		if (charGold < goldCost) {
+		if (true) {
 			return fail({
 				code: "INSUFFICIENT_GOLD",
killedBy: RetrainService should retrain familiar successfully for flat cost of 50 gold and 3 days
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:208:16
 		// biome-ignore lint/suspicious/noExplicitAny: gold runtime check
 		const charGold = (character as any).gold ?? 0;
 		if (charGold < goldCost) {
-			return fail({
-				code: "INSUFFICIENT_GOLD",
-				message: `Ouro insuficiente para retreinar familiar. Requer 50 PO, possui ${charGold} PO.`,
-			});
+			return fail({});
 		}
 
killedBy: RetrainService deve retornar erro de ouro insuficiente ao retreinar familiar
statusReason: expected undefined to be 'INSUFFICIENT_GOLD' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:214:7
 			});
 		}
 
-		if (params.currentDowntimeDays < downtimeCost) {
+		if (false) {
 			return fail({
 				code: "INSUFFICIENT_DOWNTIME",
killedBy: RetrainService deve retornar erro de downtime insuficiente ao retreinar familiar
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:216:11
 
 		if (params.currentDowntimeDays < downtimeCost) {
 			return fail({
-				code: "INSUFFICIENT_DOWNTIME",
+				code: "",
 				message: `Downtime insuficiente. Requer 3 dias, possui ${params.currentDowntimeDays} dias.`,
 			});
killedBy: RetrainService deve retornar erro de downtime insuficiente ao retreinar familiar
statusReason: expected '' to be 'INSUFFICIENT_DOWNTIME' // Object.is equality

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:228:25
 		};
 
 		const saveRes = await this.repository.save(updatedChar);
-		if (!saveRes.success) {
-			return fail({
-				code: "REPOSITORY_ERROR",
-				message: "Falha ao salvar dados do personagem no SQLite.",
-			});
-		}
+		if (!saveRes.success) {}
 
 		return ok({
killedBy: RetrainService deve retornar erro de repositorio ao falhar no salvamento do personagem no retrainFamiliar
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:229:16
 
 		const saveRes = await this.repository.save(updatedChar);
 		if (!saveRes.success) {
-			return fail({
-				code: "REPOSITORY_ERROR",
-				message: "Falha ao salvar dados do personagem no SQLite.",
-			});
+			return fail({});
 		}
 
killedBy: RetrainService deve retornar erro de repositorio ao falhar no salvamento do personagem no retrainFamiliar
statusReason: expected undefined to be 'REPOSITORY_ERROR' // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:256:7
 	> {
 		const effectsRes =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!effectsRes.success) {
+		if (false) {
 			return fail({
 				code: "REPOSITORY_ERROR",
killedBy: RetrainService deve retornar erro de repositorio ao falhar na busca de status effects no registerTestUsage
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:256:28
 	> {
 		const effectsRes =
 			await this.repository.findStatusEffectsByCharacterId(characterId);
-		if (!effectsRes.success) {
-			return fail({
-				code: "REPOSITORY_ERROR",
-				message: "Falha ao buscar status effects do personagem.",
-			});
-		}
+		if (!effectsRes.success) {}
 
 		const latentEffect = effectsRes.data.find(
killedBy: RetrainService deve retornar erro de repositorio ao falhar na busca de status effects no registerTestUsage
statusReason: Cannot read properties of undefined (reading 'find')

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:264:11
 		}
 
 		const latentEffect = effectsRes.data.find(
-			(e) => e.type === "latent_discoordination" && e.metadata === axisUsed,
+			(e) => false,
 		);
 
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
entities/character/domain/RetrainService.ts:264:11
 		}
 
 		const latentEffect = effectsRes.data.find(
-			(e) => e.type === "latent_discoordination" && e.metadata === axisUsed,
+			(e) => e.type !== "latent_discoordination" && e.metadata === axisUsed,
 		);
 
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:267:7
 			(e) => e.type === "latent_discoordination" && e.metadata === axisUsed,
 		);
 
-		if (!latentEffect) {
+		if (true) {
 			return ok({ active: false, testsLeft: 0 });
 		}
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:267:22
 			(e) => e.type === "latent_discoordination" && e.metadata === axisUsed,
 		);
 
-		if (!latentEffect) {
-			return ok({ active: false, testsLeft: 0 });
-		}
+		if (!latentEffect) {}
 
 		const nextSeverity = latentEffect.severity - 1;
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: Cannot read properties of undefined (reading 'severity')

[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:268:24
 		);
 
 		if (!latentEffect) {
-			return ok({ active: false, testsLeft: 0 });
+			return ok({ active: true, testsLeft: 0 });
 		}
 
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
entities/character/domain/RetrainService.ts:271:24
 			return ok({ active: false, testsLeft: 0 });
 		}
 
-		const nextSeverity = latentEffect.severity - 1;
+		const nextSeverity = latentEffect.severity + 1;
 		if (nextSeverity <= 0) {
 			// Remove o efeito de status completamente
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected 4 to be 2 // Object.is equality

[Killed] EqualityOperator
entities/character/domain/RetrainService.ts:272:7
 		}
 
 		const nextSeverity = latentEffect.severity - 1;
-		if (nextSeverity <= 0) {
+		if (nextSeverity > 0) {
 			// Remove o efeito de status completamente
 			const delRes = await this.repository.deleteStatusEffect(latentEffect.id);
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:272:7
 		}
 
 		const nextSeverity = latentEffect.severity - 1;
-		if (nextSeverity <= 0) {
+		if (false) {
 			// Remove o efeito de status completamente
 			const delRes = await this.repository.deleteStatusEffect(latentEffect.id);
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
entities/character/domain/RetrainService.ts:275:25
 		if (nextSeverity <= 0) {
 			// Remove o efeito de status completamente
 			const delRes = await this.repository.deleteStatusEffect(latentEffect.id);
-			if (!delRes.success) {
-				return fail({
-					code: "STATUS_EFFECT_ERROR",
-					message: "Falha ao expirar status de Descoordenação Latente.",
-				});
-			}
+			if (!delRes.success) {}
 			return ok({ active: false, testsLeft: 0 });
 		}
killedBy: RetrainService deve retornar erro de repositorio ao falhar na deleção do status de descoordenação
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:275:8
 		if (nextSeverity <= 0) {
 			// Remove o efeito de status completamente
 			const delRes = await this.repository.deleteStatusEffect(latentEffect.id);
-			if (!delRes.success) {
+			if (false) {
 				return fail({
 					code: "STATUS_EFFECT_ERROR",
killedBy: RetrainService deve retornar erro de repositorio ao falhar na deleção do status de descoordenação
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:276:17
 			// Remove o efeito de status completamente
 			const delRes = await this.repository.deleteStatusEffect(latentEffect.id);
 			if (!delRes.success) {
-				return fail({
-					code: "STATUS_EFFECT_ERROR",
-					message: "Falha ao expirar status de Descoordenação Latente.",
-				});
+				return fail({});
 			}
 			return ok({ active: false, testsLeft: 0 });
killedBy: RetrainService deve retornar erro de repositorio ao falhar na deleção do status de descoordenação
statusReason: expected undefined to be 'STATUS_EFFECT_ERROR' // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:278:15
 			if (!delRes.success) {
 				return fail({
 					code: "STATUS_EFFECT_ERROR",
-					message: "Falha ao expirar status de Descoordenação Latente.",
+					message: "",
 				});
 			}
killedBy: RetrainService deve retornar erro de repositorio ao falhar na deleção do status de descoordenação
statusReason: expected '' to be 'Falha ao expirar status de Descoorden…' // Object.is equality
