[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:281:24
 					message: "Falha ao expirar status de Descoordenação Latente.",
 				});
 			}
-			return ok({ active: false, testsLeft: 0 });
+			return ok({ active: true, testsLeft: 0 });
 		}
 
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
entities/character/domain/RetrainService.ts:285:25
 		}
 
 		// Atualiza severidade (testes restantes)
-		const updatedEffect = {
-			...latentEffect,
-			severity: nextSeverity,
-			updatedAt: new Date().toISOString(),
-		};
+		const updatedEffect = {};
 
 		const saveEffectRes = await this.repository.saveStatusEffect(updatedEffect);
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected 3 to be 2 // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:292:7
 		};
 
 		const saveEffectRes = await this.repository.saveStatusEffect(updatedEffect);
-		if (!saveEffectRes.success) {
+		if (saveEffectRes.success) {
 			return fail({
 				code: "STATUS_EFFECT_ERROR",
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
entities/character/domain/RetrainService.ts:292:7
 		};
 
 		const saveEffectRes = await this.repository.saveStatusEffect(updatedEffect);
-		if (!saveEffectRes.success) {
+		if (true) {
 			return fail({
 				code: "STATUS_EFFECT_ERROR",
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
entities/character/domain/RetrainService.ts:294:11
 		const saveEffectRes = await this.repository.saveStatusEffect(updatedEffect);
 		if (!saveEffectRes.success) {
 			return fail({
-				code: "STATUS_EFFECT_ERROR",
+				code: "",
 				message: "Falha ao atualizar contador de Descoordenação Latente.",
 			});
killedBy: RetrainService deve retornar erro de repositorio ao falhar na atualização do status de descoordenação
statusReason: expected '' to be 'STATUS_EFFECT_ERROR' // Object.is equality

[Killed] BooleanLiteral
entities/character/domain/RetrainService.ts:300:12
 		}
 
 		return ok({
-			active: true,
+			active: false,
 			testsLeft: nextSeverity,
 		});
killedBy: RetrainService should manage latent discoordination lifecycle properly under registerTestUsage
statusReason: expected false to be true // Object.is equality
