[Killed] BlockStatement
shared/dice/domain/DiceService.ts:24:70
 		private readonly clock: DiceClock,
 	) {}
 
-	public rollD20(input: unknown): Result<DiceRollResult, DiceFailure> {
-		const parsed = diceD20RollInputSchema.safeParse(input);
-		if (!parsed.success) {
-			return fail({
-				code: "INVALID_DICE_REASON",
-				message: "Dice roll reason is invalid.",
-				details: { issues: formatDiceIssues(parsed.error.issues) },
-			});
-		}
-
-		return this.rollParsedDie({
-			sides: PANDORHA_RULES.DICE.D20_SIDES,
-			reason: parsed.data.reason,
-		});
-	}
+	public rollD20(input: unknown): Result<DiceRollResult, DiceFailure> {}
 
 	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
killedBy: Combat Simulation (Monte Carlo & Balancing Audit) deve rodar 1.000 iterações de simulação de combate (Modo Arena)
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] BlockStatement
shared/dice/domain/DiceService.ts:26:24
 
 	public rollD20(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceD20RollInputSchema.safeParse(input);
-		if (!parsed.success) {
-			return fail({
-				code: "INVALID_DICE_REASON",
-				message: "Dice roll reason is invalid.",
-				details: { issues: formatDiceIssues(parsed.error.issues) },
-			});
-		}
+		if (!parsed.success) {}
 
 		return this.rollParsedDie({
killedBy: DiceService rejects invalid d20 roll reason
statusReason: Cannot read properties of undefined (reading 'reason')

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:26:7
 
 	public rollD20(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceD20RollInputSchema.safeParse(input);
-		if (!parsed.success) {
+		if (false) {
 			return fail({
 				code: "INVALID_DICE_REASON",
killedBy: DiceService rejects invalid d20 roll reason
statusReason: Cannot read properties of undefined (reading 'reason')

[Survived] StringLiteral
shared/dice/domain/DiceService.ts:29:14
 		if (!parsed.success) {
 			return fail({
 				code: "INVALID_DICE_REASON",
-				message: "Dice roll reason is invalid.",
+				message: "",
 				details: { issues: formatDiceIssues(parsed.error.issues) },
 			});

[Killed] BlockStatement
shared/dice/domain/DiceService.ts:40:70
 		});
 	}
 
-	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
-		const parsed = diceRollInputSchema.safeParse(input);
-		if (!parsed.success) {
-			const code = parsed.error.issues.some((issue) =>
-				issue.path.includes("sides"),
-			)
-				? "INVALID_DIE_SIDES"
-				: "INVALID_DICE_REASON";
-
-			return fail({
-				code,
-				message:
-					code === "INVALID_DIE_SIDES"
-						? "Die sides value is invalid."
-						: "Dice roll reason is invalid.",
-				details: { issues: formatDiceIssues(parsed.error.issues) },
-			});
-		}
-
-		return this.rollParsedDie(parsed.data);
-	}
+	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {}
 
 	private rollParsedDie(
killedBy: Combat Simulation (Monte Carlo & Balancing Audit) deve rodar 1.000 iterações de simulação de combate (Modo Arena)
statusReason: Cannot read properties of undefined (reading 'success')

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:42:7
 
 	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceRollInputSchema.safeParse(input);
-		if (!parsed.success) {
+		if (false) {
 			const code = parsed.error.issues.some((issue) =>
 				issue.path.includes("sides"),
killedBy: DiceService rejects invalid die sides
statusReason: Cannot read properties of undefined (reading 'sides')

[Killed] BlockStatement
shared/dice/domain/DiceService.ts:42:24
 
 	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceRollInputSchema.safeParse(input);
-		if (!parsed.success) {
-			const code = parsed.error.issues.some((issue) =>
-				issue.path.includes("sides"),
-			)
-				? "INVALID_DIE_SIDES"
-				: "INVALID_DICE_REASON";
-
-			return fail({
-				code,
-				message:
-					code === "INVALID_DIE_SIDES"
-						? "Die sides value is invalid."
-						: "Dice roll reason is invalid.",
-				details: { issues: formatDiceIssues(parsed.error.issues) },
-			});
-		}
+		if (!parsed.success) {}
 
 		return this.rollParsedDie(parsed.data);
killedBy: DiceService rejects invalid die sides
statusReason: Cannot read properties of undefined (reading 'sides')

[Killed] ArrowFunction
shared/dice/domain/DiceService.ts:43:42
 	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceRollInputSchema.safeParse(input);
 		if (!parsed.success) {
-			const code = parsed.error.issues.some((issue) =>
-				issue.path.includes("sides"),
+			const code = parsed.error.issues.some(() => undefined,
 			)
 				? "INVALID_DIE_SIDES"
killedBy: DiceService rejects invalid die sides
statusReason: expected 'INVALID_DICE_REASON' to be 'INVALID_DIE_SIDES' // Object.is equality

[Survived] MethodExpression
shared/dice/domain/DiceService.ts:43:17
 	public rollDie(input: unknown): Result<DiceRollResult, DiceFailure> {
 		const parsed = diceRollInputSchema.safeParse(input);
 		if (!parsed.success) {
-			const code = parsed.error.issues.some((issue) =>
-				issue.path.includes("sides"),
-			)
+			const code = parsed.error.issues.every(issue => issue.path.includes("sides"))
 				? "INVALID_DIE_SIDES"
 				: "INVALID_DICE_REASON";

[Killed] StringLiteral
shared/dice/domain/DiceService.ts:47:7
 				issue.path.includes("sides"),
 			)
 				? "INVALID_DIE_SIDES"
-				: "INVALID_DICE_REASON";
+				: "";
 
 			return fail({
killedBy: DiceService rejects invalid generic die roll reason
statusReason: expected '' to be 'INVALID_DICE_REASON' // Object.is equality

[Killed] ObjectLiteral
shared/dice/domain/DiceService.ts:49:16
 				? "INVALID_DIE_SIDES"
 				: "INVALID_DICE_REASON";
 
-			return fail({
-				code,
-				message:
-					code === "INVALID_DIE_SIDES"
-						? "Die sides value is invalid."
-						: "Dice roll reason is invalid.",
-				details: { issues: formatDiceIssues(parsed.error.issues) },
-			});
+			return fail({});
 		}
 
killedBy: DiceService rejects invalid die sides
statusReason: expected undefined to be 'INVALID_DIE_SIDES' // Object.is equality

[Survived] ConditionalExpression
shared/dice/domain/DiceService.ts:52:6
 			return fail({
 				code,
 				message:
-					code === "INVALID_DIE_SIDES"
+					false
 						? "Die sides value is invalid."
 						: "Dice roll reason is invalid.",

[Survived] ConditionalExpression
shared/dice/domain/DiceService.ts:52:6
 			return fail({
 				code,
 				message:
-					code === "INVALID_DIE_SIDES"
+					true
 						? "Die sides value is invalid."
 						: "Dice roll reason is invalid.",

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:66:37
 		input: DiceRollInput,
 	): Result<DiceRollResult, DiceFailure> {
 		const rngValue = this.rng.next();
-		if (!Number.isFinite(rngValue) || rngValue < 0 || rngValue >= 1) {
+		if (!Number.isFinite(rngValue) || false || rngValue >= 1) {
 			return fail({
 				code: "INVALID_RNG_VALUE",
killedBy: DiceService Property-Based Tests should return INVALID_RNG_VALUE for any RNG value outside [0, 1)
statusReason: Property failed after 5 tests
{ seed: -1023750624, path: "4:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [-5e-324]
Shrunk 62 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BlockStatement
shared/dice/domain/DiceService.ts:66:68
 		input: DiceRollInput,
 	): Result<DiceRollResult, DiceFailure> {
 		const rngValue = this.rng.next();
-		if (!Number.isFinite(rngValue) || rngValue < 0 || rngValue >= 1) {
-			return fail({
-				code: "INVALID_RNG_VALUE",
-				message: "Dice RNG returned a value outside the [0, 1) range.",
-				details: { value: String(rngValue) },
-			});
-		}
+		if (!Number.isFinite(rngValue) || rngValue < 0 || rngValue >= 1) {}
 
 		const naturalRoll = Math.floor(rngValue * input.sides) + 1;
killedBy: DiceService rejects invalid RNG value -0.01
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
shared/dice/domain/DiceService.ts:68:11
 		const rngValue = this.rng.next();
 		if (!Number.isFinite(rngValue) || rngValue < 0 || rngValue >= 1) {
 			return fail({
-				code: "INVALID_RNG_VALUE",
+				code: "",
 				message: "Dice RNG returned a value outside the [0, 1) range.",
 				details: { value: String(rngValue) },
killedBy: DiceService rejects invalid RNG value -0.01
statusReason: expected '' to be 'INVALID_RNG_VALUE' // Object.is equality

[Killed] ArithmeticOperator
shared/dice/domain/DiceService.ts:74:23
 			});
 		}
 
-		const naturalRoll = Math.floor(rngValue * input.sides) + 1;
+		const naturalRoll = Math.floor(rngValue * input.sides) - 1;
 		const auditEntry = {
 			rollId: this.rollIdProvider.generate(),
killedBy: DiceService rolls a deterministic d20 result with audit metadata
statusReason: expected { naturalRoll: 8, sides: 20, …(3) } to deeply equal { naturalRoll: 10, sides: 20, …(3) }

[Killed] ArithmeticOperator
shared/dice/domain/DiceService.ts:74:34
 			});
 		}
 
-		const naturalRoll = Math.floor(rngValue * input.sides) + 1;
+		const naturalRoll = Math.floor(rngValue / input.sides) + 1;
 		const auditEntry = {
 			rollId: this.rollIdProvider.generate(),
killedBy: ResolutionService Property-Based Tests should always result in success or criticalSuccess if natural roll is 20, regardless of modifiers or DC
statusReason: Property failed after 1 tests
{ seed: 117518031, path: "0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"reason":"!","level":0,"axisValue":0,"applicationValue":0,"itemBonus":0,"dc":1}]
Shrunk 9 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ObjectLiteral
shared/dice/domain/DiceService.ts:75:22
 		}
 
 		const naturalRoll = Math.floor(rngValue * input.sides) + 1;
-		const auditEntry = {
-			rollId: this.rollIdProvider.generate(),
-			reason: input.reason,
-			sides: input.sides,
-			naturalRoll,
-			createdAt: this.clock.now(),
-		};
+		const auditEntry = {};
 
 		return ok({
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected undefined to be 'teste de atletismo' // Object.is equality

[Killed] ObjectLiteral
shared/dice/domain/DiceService.ts:83:13
 			createdAt: this.clock.now(),
 		};
 
-		return ok({
-			naturalRoll,
-			sides: input.sides,
-			isNaturalCritical:
-				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
-				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
-			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
-			auditEntry,
-		});
+		return ok({});
 	}
 }
killedBy: DungeonService deve gerar armadilhas procedimentais deterministicamente baseadas na semente
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:87:5
 			naturalRoll,
 			sides: input.sides,
 			isNaturalCritical:
-				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
-				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
+				false,
 			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
 			auditEntry,
killedBy: DiceService Property-Based Tests should correctly identify critical hits (natural 20) and failures (natural 1) on d20
statusReason: Property failed after 29 tests
{ seed: -643531372, path: "28:14:0:2:0:1:12:0:2:0:1:12:0:3:0", endOnFailure: true }
Counterexample: [0.95]
Shrunk 14 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:87:5
 			naturalRoll,
 			sides: input.sides,
 			isNaturalCritical:
-				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
-				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
+				true,
 			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
 			auditEntry,
killedBy: DiceService Property-Based Tests should correctly identify critical hits (natural 20) and failures (natural 1) on d20
statusReason: Property failed after 1 tests
{ seed: 1773998911, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:88:5
 			sides: input.sides,
 			isNaturalCritical:
 				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
-				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
+				true,
 			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
 			auditEntry,
killedBy: DiceService rolls a deterministic d20 result with audit metadata
statusReason: expected { naturalRoll: 10, sides: 20, …(3) } to deeply equal { naturalRoll: 10, sides: 20, …(3) }

[Killed] EqualityOperator
shared/dice/domain/DiceService.ts:88:5
 			sides: input.sides,
 			isNaturalCritical:
 				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
-				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
+				naturalRoll !== PANDORHA_RULES.DICE.NATURAL_CRITICAL,
 			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
 			auditEntry,
killedBy: DiceService Property-Based Tests should correctly identify critical hits (natural 20) and failures (natural 1) on d20
statusReason: Property failed after 1 tests
{ seed: 992187653, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
shared/dice/domain/DiceService.ts:89:22
 			isNaturalCritical:
 				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
 				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
-			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
+			isNaturalFailure: false,
 			auditEntry,
 		});
killedBy: DiceService Property-Based Tests should correctly identify critical hits (natural 20) and failures (natural 1) on d20
statusReason: Property failed after 1 tests
{ seed: 1783511328, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
shared/dice/domain/DiceService.ts:89:22
 			isNaturalCritical:
 				input.sides === PANDORHA_RULES.DICE.D20_SIDES &&
 				naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL,
-			isNaturalFailure: naturalRoll === PANDORHA_RULES.DICE.NATURAL_FAILURE,
+			isNaturalFailure: naturalRoll !== PANDORHA_RULES.DICE.NATURAL_FAILURE,
 			auditEntry,
 		});
killedBy: DiceService Property-Based Tests should correctly identify critical hits (natural 20) and failures (natural 1) on d20
statusReason: Property failed after 1 tests
{ seed: -1819274543, path: "0:0", endOnFailure: true }
Counterexample: [0]
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run
