[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:26:7
 		input: unknown,
 	): Result<ResolutionResult, ResolutionFailure> {
 		const parsed = globalTestInputSchema.safeParse(input);
-		if (!parsed.success) {
+		if (true) {
 			return fail({
 				code: "INVALID_RESOLUTION_INPUT",
killedBy: Combat Simulation (Monte Carlo & Balancing Audit) deve rodar 1.000 iterações de simulação de combate (Modo Arena)
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] BooleanLiteral
shared/resolution/domain/ResolutionService.ts:26:7
 		input: unknown,
 	): Result<ResolutionResult, ResolutionFailure> {
 		const parsed = globalTestInputSchema.safeParse(input);
-		if (!parsed.success) {
+		if (parsed.success) {
 			return fail({
 				code: "INVALID_RESOLUTION_INPUT",
killedBy: Combat Simulation (Monte Carlo & Balancing Audit) deve rodar 1.000 iterações de simulação de combate (Modo Arena)
statusReason: Cannot read properties of undefined (reading 'issues')

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:35:7
 		}
 
 		const diceRoll = this.diceService.rollD20({ reason: parsed.data.reason });
-		if (!diceRoll.success) {
+		if (false) {
 			return fail({
 				code: "DICE_ROLL_FAILED",
killedBy: ResolutionService propagates dice failures as typed resolution failures
statusReason: Cannot read properties of undefined (reading 'naturalRoll')

[Killed] BooleanLiteral
shared/resolution/domain/ResolutionService.ts:35:7
 		}
 
 		const diceRoll = this.diceService.rollD20({ reason: parsed.data.reason });
-		if (!diceRoll.success) {
+		if (diceRoll.success) {
 			return fail({
 				code: "DICE_ROLL_FAILED",
killedBy: Combat Simulation (Monte Carlo & Balancing Audit) deve rodar 1.000 iterações de simulação de combate (Modo Arena)
statusReason: Cannot read properties of undefined (reading 'code')

[Killed] ObjectLiteral
shared/resolution/domain/ResolutionService.ts:36:16
 
 		const diceRoll = this.diceService.rollD20({ reason: parsed.data.reason });
 		if (!diceRoll.success) {
-			return fail({
-				code: "DICE_ROLL_FAILED",
-				message: "Dice service failed while resolving the global test.",
-				details: { diceFailureCode: diceRoll.error.code },
-				cause: diceRoll.error,
-			});
+			return fail({});
 		}
 
killedBy: ResolutionService propagates dice failures as typed resolution failures
statusReason: expected undefined to be 'DICE_ROLL_FAILED' // Object.is equality

[Killed] StringLiteral
shared/resolution/domain/ResolutionService.ts:37:11
 		const diceRoll = this.diceService.rollD20({ reason: parsed.data.reason });
 		if (!diceRoll.success) {
 			return fail({
-				code: "DICE_ROLL_FAILED",
+				code: "",
 				message: "Dice service failed while resolving the global test.",
 				details: { diceFailureCode: diceRoll.error.code },
killedBy: ResolutionService propagates dice failures as typed resolution failures
statusReason: expected '' to be 'DICE_ROLL_FAILED' // Object.is equality

[Survived] StringLiteral
shared/resolution/domain/ResolutionService.ts:38:14
 		if (!diceRoll.success) {
 			return fail({
 				code: "DICE_ROLL_FAILED",
-				message: "Dice service failed while resolving the global test.",
+				message: "",
 				details: { diceFailureCode: diceRoll.error.code },
 				cause: diceRoll.error,

[Killed] ArithmeticOperator
shared/resolution/domain/ResolutionService.ts:45:18
 		}
 
 		const total = calculateTotal(parsed.data, diceRoll.data.naturalRoll);
-		const margin = total - parsed.data.dc;
+		const margin = total + parsed.data.dc;
 		const isNaturalSuccess =
 			diceRoll.data.naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL;
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'criticalSuccess', …(11) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:47:4
 		const total = calculateTotal(parsed.data, diceRoll.data.naturalRoll);
 		const margin = total - parsed.data.dc;
 		const isNaturalSuccess =
-			diceRoll.data.naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL;
+			false;
 
 		return ok({
killedBy: ResolutionService natural 20 guarantees at least success but does not become critical without margin +10
statusReason: expected 'failure' to be 'success' // Object.is equality

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:47:4
 		const total = calculateTotal(parsed.data, diceRoll.data.naturalRoll);
 		const margin = total - parsed.data.dc;
 		const isNaturalSuccess =
-			diceRoll.data.naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL;
+			true;
 
 		return ok({
killedBy: CombatEncounterService keeps target HP unchanged when the attack fails
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
shared/resolution/domain/ResolutionService.ts:50:26
 			diceRoll.data.naturalRoll === PANDORHA_RULES.DICE.NATURAL_CRITICAL;
 
 		return ok({
-			degree: resolveDegree({
-				margin,
-				isNaturalSuccess,
-				isNaturalFailure: diceRoll.data.isNaturalFailure,
-			}),
+			degree: resolveDegree({}),
 			total,
 			margin,
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'failure', total: 18, …(10) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] BlockStatement
shared/resolution/domain/ResolutionService.ts:76:78
 	}
 }
 
-function calculateTotal(input: GlobalTestInput, naturalRoll: number): number {
-	return (
-		naturalRoll +
-		input.level +
-		input.axisValue +
-		input.applicationValue +
-		input.itemBonus
-	);
-}
+function calculateTotal(input: GlobalTestInput, naturalRoll: number): number {}
 
 function resolveDegree(input: {
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'failure', …(11) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] ArithmeticOperator
shared/resolution/domain/ResolutionService.ts:78:3
 
 function calculateTotal(input: GlobalTestInput, naturalRoll: number): number {
 	return (
-		naturalRoll +
-		input.level +
-		input.axisValue +
-		input.applicationValue +
+		naturalRoll + input.level + input.axisValue - input.applicationValue +
 		input.itemBonus
 	);
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'successWithCost', …(11) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] ArithmeticOperator
shared/resolution/domain/ResolutionService.ts:78:3
 
 function calculateTotal(input: GlobalTestInput, naturalRoll: number): number {
 	return (
-		naturalRoll +
-		input.level +
-		input.axisValue +
-		input.applicationValue +
-		input.itemBonus
+		naturalRoll + input.level + input.axisValue + input.applicationValue - input.itemBonus
 	);
 }
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'successWithCost', …(11) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] BlockStatement
shared/resolution/domain/ResolutionService.ts:90:22
 	readonly margin: number;
 	readonly isNaturalSuccess: boolean;
 	readonly isNaturalFailure: boolean;
-}): ResolutionDegree {
-	if (input.isNaturalFailure) {
-		return "failure";
-	}
-
-	if (input.margin >= PANDORHA_RULES.UNIVERSAL_TESTS.CRITICAL_MARGIN) {
-		return "criticalSuccess";
-	}
-
-	if (input.margin >= 0 || input.isNaturalSuccess) {
-		return "success";
-	}
-
-	if (
-		input.margin >= -PANDORHA_RULES.UNIVERSAL_TESTS.SUCCESS_WITH_COST_MARGIN
-	) {
-		return "successWithCost";
-	}
-
-	return "failure";
-}
+}): ResolutionDegree {}
 
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: undefined, total: 18, …(10) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:91:6
 	readonly isNaturalSuccess: boolean;
 	readonly isNaturalFailure: boolean;
 }): ResolutionDegree {
-	if (input.isNaturalFailure) {
+	if (true) {
 		return "failure";
 	}
killedBy: ResolutionService resolves a regular success when total reaches DC
statusReason: expected { degree: 'failure', total: 18, …(10) } to match object { degree: 'success', total: 18, …(8) }
(12 matching properties omitted from actual)

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:91:6
 	readonly isNaturalSuccess: boolean;
 	readonly isNaturalFailure: boolean;
 }): ResolutionDegree {
-	if (input.isNaturalFailure) {
+	if (false) {
 		return "failure";
 	}
killedBy: ResolutionService natural 1 forces a failure even if modifiers would reach DC
statusReason: expected 'success' to be 'failure' // Object.is equality

[Killed] StringLiteral
shared/resolution/domain/ResolutionService.ts:92:10
 	readonly isNaturalFailure: boolean;
 }): ResolutionDegree {
 	if (input.isNaturalFailure) {
-		return "failure";
+		return "";
 	}
 
killedBy: ResolutionService natural 1 forces a failure even if modifiers would reach DC
statusReason: expected '' to be 'failure' // Object.is equality

[Killed] EqualityOperator
shared/resolution/domain/ResolutionService.ts:95:6
 		return "failure";
 	}
 
-	if (input.margin >= PANDORHA_RULES.UNIVERSAL_TESTS.CRITICAL_MARGIN) {
+	if (input.margin < PANDORHA_RULES.UNIVERSAL_TESTS.CRITICAL_MARGIN) {
 		return "criticalSuccess";
 	}
killedBy: CombatEncounterService reduces target HP when an attack succeeds
statusReason: expected +0 to be 9 // Object.is equality

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:95:6
 		return "failure";
 	}
 
-	if (input.margin >= PANDORHA_RULES.UNIVERSAL_TESTS.CRITICAL_MARGIN) {
+	if (true) {
 		return "criticalSuccess";
 	}
killedBy: CombatEncounterService reduces target HP when an attack succeeds
statusReason: expected +0 to be 9 // Object.is equality

[Killed] StringLiteral
shared/resolution/domain/ResolutionService.ts:96:10
 	}
 
 	if (input.margin >= PANDORHA_RULES.UNIVERSAL_TESTS.CRITICAL_MARGIN) {
-		return "criticalSuccess";
+		return "";
 	}
 
killedBy: ResolutionService resolves a critical success by margin +10
statusReason: expected '' to be 'criticalSuccess' // Object.is equality

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:99:6
 		return "criticalSuccess";
 	}
 
-	if (input.margin >= 0 || input.isNaturalSuccess) {
+	if (true) {
 		return "success";
 	}
killedBy: ResolutionService resolves success with cost when the result misses DC by up to four
statusReason: expected 'success' to be 'successWithCost' // Object.is equality

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:99:6
 		return "criticalSuccess";
 	}
 
-	if (input.margin >= 0 || input.isNaturalSuccess) {
+	if (false) {
 		return "success";
 	}
killedBy: CombatEncounterService reduces target HP when an attack succeeds
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:104:3
 	}
 
 	if (
-		input.margin >= -PANDORHA_RULES.UNIVERSAL_TESTS.SUCCESS_WITH_COST_MARGIN
+		false
 	) {
 		return "successWithCost";
killedBy: ResolutionService resolves success with cost when the result misses DC by up to four
statusReason: expected 'failure' to be 'successWithCost' // Object.is equality

[Killed] ConditionalExpression
shared/resolution/domain/ResolutionService.ts:104:3
 	}
 
 	if (
-		input.margin >= -PANDORHA_RULES.UNIVERSAL_TESTS.SUCCESS_WITH_COST_MARGIN
+		true
 	) {
 		return "successWithCost";
killedBy: ResolutionService resolves failure when the result misses DC by five or more
statusReason: expected 'successWithCost' to be 'failure' // Object.is equality

[Killed] BlockStatement
shared/resolution/domain/ResolutionService.ts:105:4
 
 	if (
 		input.margin >= -PANDORHA_RULES.UNIVERSAL_TESTS.SUCCESS_WITH_COST_MARGIN
-	) {
-		return "successWithCost";
-	}
+	) {}
 
 	return "failure";
killedBy: ResolutionService resolves success with cost when the result misses DC by up to four
statusReason: expected 'failure' to be 'successWithCost' // Object.is equality

[Killed] StringLiteral
shared/resolution/domain/ResolutionService.ts:106:10
 	if (
 		input.margin >= -PANDORHA_RULES.UNIVERSAL_TESTS.SUCCESS_WITH_COST_MARGIN
 	) {
-		return "successWithCost";
+		return "";
 	}
 
killedBy: ResolutionService resolves success with cost when the result misses DC by up to four
statusReason: expected '' to be 'successWithCost' // Object.is equality

[Killed] StringLiteral
shared/resolution/domain/ResolutionService.ts:109:9
 		return "successWithCost";
 	}
 
-	return "failure";
+	return "";
 }
 
killedBy: ResolutionService resolves failure when the result misses DC by five or more
statusReason: expected '' to be 'failure' // Object.is equality
